/******************************************************************************
*@Copyright UniGium Information Technology (ShangHai) Co.,Ltd. 2003 ALL RIGHTS RESERVED.

  *file name    : TextMsg.h
  *owner  		: Stephen
  *description  : 
  *modified     : 2004/12/29
******************************************************************************/ 

#ifndef _TEXTMSG_H_
#define _TEXTMSG_H_


#ifdef  GB_VERSION  //{




// -------- Error Message ---------------
// --- connect
#define MSG_CONNECT_SERVER_ERROR		"服务器忙碌中,请稍后再试..."
#define MSG_ACCOUND_ERROR				"帐号或者密码错误,请重新输入!"
#define MSG_CHAT_SERVER_ERROR			"聊天服务器错误!"
#define MSG_NICKNANE_ERROR				"昵称已经有人使用"
#define MSG_CREATE_CHARACTER_ERROR		"无法创建人物"
#define MSG_EXIST_SCENE_ERROR			"同一个帐号不能有玩一个以上的角色，程序将推出"
#define MSG_OTHER_ENTER_SCENE_ERROR		"这个帐号已经有其他玩家登录了"
#define MSG_CHARACTER_CLOSE				"目前该角色还未开放!!!,请选择其他角色"
// --- File
#define MSG_FILE_CREAT_ERROR			"无法创建 %s 档案"
#define MSG_FILE_OPEN_ERROR				"无法开启 %s 档案"
#define MSG_FILE_CHECK_ERROR			"%s 档案检查错误"
#define MSG_FILE_RANGE_ERROR			"%s 档案大小错误"
#define MSG_FILE_DECODE_ERROR			"%s 档案解码错误"
// --- Memory 
#define MSG_MEMORY_ALLOC_ERROR			"无法配置内存"
// --- Graph
#define MSG_IMG256_DECODE_ERROR			"IMG256 解码错误(%x)"
#define MSG_BUFFER_NOT_IMG256_FORMAT	"缓冲区不是 IMG256 格式"
// --- MDA dile
#define MSG_FILE_NOT_MDA_ERROR			"%s 不是 MDA 档案"
#define MSG_MDA_COMMAND_ERROR			"MDA 错误命令(%s)"
#define MSG_MDA_DATABASE_FRAME_ERROR	"MDA 帧数错误(%d)"
#define MSG_MDA_UNKNOW_COMMAND			"无法解读的 MDA 外部命令(%s)"
// --- MAP 
#define MSG_MAP_FILE_LOAD_ERROR			"无法载入地图档案(%s)"
#define MSG_MAP_VERSION_ERROR			"地图档案(%s)版本错误"
#define MSG_MAP_FORMAT_ERROR			"地图档案(%s)格式错误"
// --- Game rule
#define MSG_BAOBAO_FOLLOW_ERROR			"宠物跟随错误!"
#define MSG_BAOBAO_RELEASE_ERROR		"宠物目前正在观看，无法放生，请先设置不观看"
#define MSG_BAOBAO_RELEASE_ERROR1		"宠物目前正在参战，无法放生，请先设置不参战"

#define MSG_ADD_BAOBAO_ERROR			"增加宝宝数据错误,请跟GM联络!"
#define MSG_DELETE_BAOBAO_ERROR			"删除宝宝出错，不存在这个宝宝"
#define MSG_ITEM_DETAIL_ERROR			"显示物品描述错误,请跟GM联络!"
#define MSG_GIVE_ITEM_ERROR				"给予物品出错,请跟GM联络!"
#define MSG_REQUEST_DEAL_ERROR			"请求交易失败,请跟GM联络!"
#define MSG_DEAL_CANCEL_ERROR			"交易取消出错,请跟GM联络!"
#define MSG_USE_EQUIP_ERROR				"使用装备出错,请跟GM联络!"
#define MSG_BUY_ITEM_ERROR				"买物品错误,请跟GM联络!"
#define MSG_SAVE_MONEY_ERROR			"存钱错误,请跟GM联络!"
#define MSG_WITHDRAW_ERROR				"取钱错误,请跟GM联络!"
#define MSG_PUSH_POPSHOP_ERROR			"向仓库存物品出错,请跟GM联络!"
#define MSG_POP_POPSHOP_ERROR			"从仓库取物品出错,请跟GM联络!"
#define MSG_MDA_ERROR					"MDA 资料库档案名称太长,请重新安装客户端或者跟GM联络"


#define MSG_EQUIP_PHYLE_ERROR			"种族不符合,无法装备"
#define MSG_EQUIP_LEVEL_ERROR			"您的~C4等级~C0不够,无法装备这个物品"
#define MSG_EQUIP_HP_ERROR				"您的~C4体质~C0不够,无法装备这个物品"
#define MSG_EQUIP_MP_ERROR				"您的~C4智力~C0不够,无法装备这个物品"
#define MSG_EQUIP_ATT_ERROR				"您的~C4力量~C0不够,无法装备这个物品"
#define MSG_EQUIP_SPEED_ERROR			"您的~C4速度~C0不够,无法装备这个物品"

#define MSG_MONEY_NOT_ENOUGH			"你的金钱不够!!"


// -------------- Message text -------------------
// --- system
#define MSG_GAME_NAME					"神界"
#define GAME_FONT_NAME                  "宋体"


// --- Game base
#define CHARACTER_SEX_MAN_TEXT			"男"			// 男性
#define CHARACTER_SEX_WOMAN_TEXT		"女"			// 女性

#define CHARACTER_PHYLE_HUMAN_TEXT		"人类"
#define CHARACTER_PHYLE_GENUS_TEXT		"精灵"
#define CHARACTER_PHYLE_MAGIC_TEXT		"法师"
#define CHARACTER_PHYLE_ROBET_TEXT		"机械"

#define BAOBAO_PHYLE_HUMAN_TEXT			"人形系"
#define BAOBAO_PHYLE_FLY_TEXT			"飞行系"
#define BAOBAO_PHYLE_DEVIL_TEXT			"恶魔系"
#define BAOBAO_PHYLE_DEAD_TEXT			"不死系"
#define BAOBAO_PHYLE_DRAGON_TEXT		"龙系"
#define BAOBAO_PHYLE_SPECIAL_TEXT		"特殊系"


#define WEATHER_TEXT_NONE				"晴天"
#define WEATHER_TEXT_RANG				"雨"
#define WEATHER_TEXT_SNOW				"雪"
#define WEATHER_TEXT_CLOUD				"云"
#define WEATHER_TEXT_THUNDER			"雷"

#define WEATHER_TEXT_SMALL				"小"
#define WEATHER_TEXT_MIDDLE				"中"
#define WEATHER_TEXT_LARGE				"大"

#define WEATHER_TEXT_DOWN				"无"
#define WEATHER_TEXT_EN					"东北"
#define WEATHER_TEXT_WN					"西北"

#define WEATHER_TEXT_REPORT				"#Y%s#N,天气#Y%s#N,风向#Y%s#N"
#define WEATHER_TEXT_SAMPLE_REPORT		"%s风向%s"

#define CHARACTER_INST_HUMAN_MAN		"男人类,擅长控制类技能#0"
#define CHARACTER_INST_HUMAN_WOMAN		"女人类,擅长控制类技能#0"
#define CHARACTER_INST_GENUS_MAN		"男精灵,擅长多人攻击技能#0"
#define CHARACTER_INST_GENUS_WOMAN		"女精灵,擅长恢复系技能#0"
#define CHARACTER_INST_MAGIC_MAN		"男法师,擅长攻击法术技能#0"
#define CHARACTER_INST_MAGIC_WOMAN		"女法师,擅长攻击法术技能#0"
#define CHARACTER_INST_ROBET_MAN		"男机甲,擅长吸收系技能#0"
#define CHARACTER_INST_ROBET_WOMAN		"女机甲,擅长吸收系技能#0"


// --- Connect
#define MSG_SERVER_NOT_FIND				"无法连接到指定的服务器"
#define MSG_CONNECT_WAITTING			"连接服务器!请稍待......"
#define MSG_ACCOUNT_EMERY				"请输入正确的帐号名与密码"
#define MSG_CONNECT_SERVER				"正在连接服务器"
#define MSG_LAN_DISCONNECT				"网络断开连接!!!"
#define MSG_SERVER_SHUTDOWN				"服务器正在维护当中,请稍后再试!"
#define MSG_WORLD_SERVER_ERROR			"世界服务器断开连接"
#define MSG_CHAT_SERVER_CONNECT_ERROR	"聊天服务器断开连接"

// --- Game data
#define MSG_CHAR_LEVEL					"%d 级"
#define MSG_CHARACTER_CREATE_FULL		"~C2你已经创建5个人物,无法再创建新的人物~C0"
#define MSG_NOT_SELECT_PHYLE			"请选择一个种族!"
#define MSG_NOT_NICK_NAME				"请输入昵称!"

#define MSG_MAP_MAIN_MENU_INST_ITEM			"物品(I)"
#define MSG_MAP_MAIN_MENU_INST_TEAM			"组队(T)"
#define MSG_MAP_MAIN_MENU_INST_ATTACK		"攻击(A)"
#define MSG_MAP_MAIN_MENU_INST_GIVE			"给予(G)"
#define MSG_MAP_MAIN_MENU_INST_DEAL			"交易(X)"
#define MSG_MAP_MAIN_MENU_INST_MISSION		"任务(Q)"
#define MSG_MAP_MAIN_MENU_INST_GROUP		"公会(B)"
#define MSG_MAP_MAIN_MENU_INST_SYSTEM		"系统(S)"
#define MSG_MAP_MAIN_MENU_INST_CHAT			"聊天器(F)"

#define MSG_MAP_MAIN_MENU_INST_CHATWIN		"窗口切换"
#define MSG_MAP_MAIN_MENI_INST_HISTORY		"历史纪录"
#define MSG_MAP_MAIN_MENU_INST_DISCARE		"屏蔽"
#define MSG_MAP_MAIN_MENU_INST_PHIZ			"表情符号(0)"
#define MSG_MAP_MAIN_MENU_INST_SCROLL		"滚屏开关"
#define MSG_MAP_MAIN_MENU_INST_VIEW			"窗口加大"
#define MSG_MAP_MAIN_MENU_INST_UP			"上翻"
#define MSG_MAP_MAIN_MENU_INST_DOWN			"下翻"

#define MSG_MAP_MAIN_MENU_INST_SWITCH		"窗口切换"
#define MSG_MAP_MAIN_MENU_INST_WORLD		"世界地图"
#define MSG_MAP_MAIN_MENU_INST_SMALL		"缩略地图(Tab)"


#define MSG_WINDOW_CLOSE					"关闭"

#define MSG_VOLUME_SUB						"减低音量"
#define MSG_VOLUME_ADD						"加大音量"


#define MSG_CHANNEL_NAME_SCREEN				"当前"
#define MSG_CHANNEL_NAME_TEAM				"队伍"
#define MSG_CHANNEL_NAME_PERSON				"私聊"
#define MSG_CHANNEL_NAME_GROUP				"公会"
#define MSG_CHANNEL_NAME_SELLBUY			"经济"
#define MSG_CHANNEL_NAME_WORLD				"世界"
#define MSG_CHANNEL_NAME_SYSTEM				"系统"
#define MSG_CHANNEL_NAME_MESSAGE			"讯息"
			


#define MSG_CHAT_TIMER_ERROR				"#R#S请不要太快说话#N"
#define MSG_SET_PERSON_ID					"#R私聊对象设定为#N(#Y%s#N)#G%d"

#define MSG_PERSON_SEND						"你悄悄的对#Y%s#N说："
#define MSG_PERSON_RECEIVE					"#Y%s#N悄悄的对你说："


#define MSG_PLAYER_INFO_ID					" ID ：%d"
#define MSG_PLAYER_INFO_SEX					"性别：%s"
#define MSG_PLAYER_INFO_PHYLE				"种族：%s"
#define MSG_PLAYER_INFO_TITLE				"头衔：%s"
#define MSG_PLAYER_INFO_NAME				"姓名：%s"
#define MSG_PLAYER_INFO_LEVEL				"等级：%d"


#define MSG_MAX_CHAT_FRIEND					"你的好友栏已经满了,无法执行这个操作!"
#define MSG_ADD_FRIEND						"#9你已经将#Y%s#N加为好友了!#21"
#define MSG_ADD_TEMP_FRIEND					"#9你已经将#Y%s#N加为临时好友了!#21"
#define MSG_ADD_DARK_FRIEND					"你已经将#Y%s#N屏蔽了!#83"
#define MSG_ADD_SAME_FRIEND					"#Y%s#N已经是你的好友了!#47"
#define MSG_OTHER_ADD_FRIEND				"%s 把你加为好友"

#define MSG_SYSTEM_ADD_FRIEND				"你已经将%s加为好友了!"
#define MSG_SYSTEM_ADD_SAME_FRIEND			"%s已经是你的好友了!"
#define MSG_FRIEND_ONLINE					"#G你的%s#Y%s#G已经进入游戏#9#N"
#define MSG_FRIEND_OFFLINE					"#R你的%s#Y%s#R已经离开游戏#N#8"



#define MSG_NEXUS_FRIEND0					"萍水相逢朋友"			// 一般朋友关系
#define MSG_NEXUS_FRIEND1					"平淡之交朋友"				
#define MSG_NEXUS_FRIEND2					"普通朋友"				
#define MSG_NEXUS_FRIEND3					"深情厚意好友"				
#define MSG_NEXUS_FRIEND4					"生死至交好友"				

#define MSG_NEXUS_MARRIAGE0					"新婚夫妻"				// 婚姻
#define MSG_NEXUS_MARRIAGE1					"老鼠大米夫妻"			
#define MSG_NEXUS_MARRIAGE2					"蜜月之爱夫妻"						
#define MSG_NEXUS_MARRIAGE3					"甜甜蜜蜜夫妻"			
#define MSG_NEXUS_MARRIAGE4					"老夫老妻"		

#define MSG_NEXUS_BROTHER0					"白瓷兄弟"				// 结拜
#define MSG_NEXUS_BROTHER1					"钢之兄弟"		
#define MSG_NEXUS_BROTHER2					"银之兄弟"		
#define MSG_NEXUS_BROTHER3					"金之兄弟"
#define MSG_NEXUS_BROTHER4					"钻石兄弟"

#define MSG_NEXUS_MASTER0					"露水师徒"				// 师徒
#define MSG_NEXUS_MASTER1					"烈火师徒"			
#define MSG_NEXUS_MASTER2					"名师高徒"
#define MSG_NEXUS_MASTER3					"良师益友"
#define MSG_NEXUS_MASTER4					"再造之恩"

		
#define MSG_MAX_FRIEND_GROUP_SEND			"群发好友人数上限"
#define MSG_NO_MESSAGE						"请输入讯息内容!"


#define MSG_ADD_FRIEND_ERROR				"对方没有打开好友开关"	

#define MSG_CHAT_SEARCH_ERROR				"没有这个玩家，或者玩家不在线"

#define MSG_TEAM_LEAVE						"#Y%s#R离开队伍"

#define MSG_ADD_TEAM_NOT_LEADER_ERROR		"对方不是队长"
#define MSG_ADD_TEAM_OK						"已经向队长提出申请，请等待"
#define MSG_ADD_TEAM_FULL					"对方申请列表已满"

#define MSG_ADD_TEAM_READY					"%s 加入队伍了"
#define MSG_LEAVE_TEAM						"请注意！%s 离开队伍"
#define MSG_BREAK_TEAM						"请注意！您解散队伍了"
#define MSG_ALREADY_IN_TEAM					"你已在申请列中了，请稍等"

#define MSG_NO_MISSION						"#Y您目前没有接受任何任务#32"


#define MSG_HP_TEXT							"生命"
#define MSG_MP_TEXT							"魔法"
#define MSG_EXP_TEXT						"经验"


#define MSG_BAOBAO_TITLE					"%s的宠物"



// ----- 战斗数值部分
#define MSG_ADD_EXP							"       ~C2恭喜！您获得 ~C4%u~C2 经验~C0       "
#define	MSG_LEVEL_UP						"       ~C1恭喜！你升到 ~C4%u~C1 级了~C0       "
#define MSG_BAOBAO_ADD_EXP					"您的宠物 #Y%s#N 在这场战斗当中获得了#R%d#N经验"
#define MSG_BAOBAO_LEVEL_UP					"#31您的宠物 #Y%s#N 升到了#Y%d#N级了#1"


#define MSG_SUB_EXP							"       ~C1您被扣了 ~C4%d~C1 经验~C0       "
#define	MSG_LEVEL_DOWN						"       ~C1您被降到 ~C4%d~C1 级了~C0       "

#define MSG_RELEASE_BAOBAO					"#G您确定要#R放生#G宠物#Y %s #G吗？#83"

#define MSG_POINT_ERROR						"~C1系统内部点数计算错误,请跟 GM 联络!~C0"


#define MSG_ITEM_DROP						"您确定丢弃? #83"

#define MSG_NO_GIVE_DATA					"没有给与的东西或者金钱! "

#define MSG_CHARACTER_MAGIC_DEFAULT			"#R主角默认技能设定#Y%s#N"
#define MSG_BAOBAO_MAGIC_DEFAULT			"#R宠物默认技能设定#Y%s#N"

#define MSG_FIGHT_IMAGE_ERROR				"战斗使用档案遗失, 无法继续进行游戏, 系统将退出, 请与 GM 联络,或重新安装"


#define MSG_ADD_SEE_FIGHT					" %s  加入观看队伍!"

#define MSG_POCKET_FULL						"你的口袋已满，买物品不成功"
#define MSG_BAOBAO_DATA_FULL				"使用的物品无法让你的宠物增加能力，不需要使用该物品"
#define MSG_BAOBAO_ITEM_ERROR				"宠物无法使用指定的物品"
#define MSG_REJECT_GIVE_ITEM				"对方没有打开物品接受开关,无法受你给予的物品"
#define MSG_SELL_ITEM_ERROR					"无法卖出此物品!"
#define MSG_SELL_ITEM_ERROR1				"物品数量不对"


// --- show 抗性资料 ----
#define MSG_FASTNESS_PROTECT				"~C4防御~C0：%d"
#define MSG_FASTNESS_SHOOT					"~C4命中~C0：%d"
#define MSG_FASTNESS_DODGE					"~C4躲避~C0：%d"
#define MSG_FASTNESS_SUCK					"~C4抗吸~C0：%d"
#define MSG_FASTNESS_CRAZY					"~C4狂暴~C0：%d%% %d"
#define MSG_FASTNESS_DEADLINESS				"~C4致命~C0：%d%% %d"
#define MSG_FASTNESS_REDEADLINESS			"~C4抗致命~C0：%d%%"
#define MSG_FASTNESS_DOUBLEATT				"~C4连击~C0：%d%% %d"
#define MSG_FASTNESS_BACKATT				"~C4反击~C0：%d%% %d"
#define MSG_FASTNESS_BREAK_PHYSICS			"~C4破物理~C0：%d%% %d"
#define MSG_FASTNESS_MAGIC_FEEDBACK			"~C4法术反馈~C0：%d%% %d"
#define MSG_FASTNESS_PHYSICS_FEEDBACK		"~C4物理反馈~C0：%d%% %d"
#define MSG_FASTNESS_DEAD					"~C4抗死亡宣告~C0：%d%%"
#define MSG_FASTNESS_MAGIC_DARK				"~C4暗法~C0：%d"
#define MSG_FASTNESS_MAGIC_LIGHT			"~C4光法~C0：%d"
#define MSG_FASTNESS_MAGIC_WATER			"~C4水法~C0：%d"
#define MSG_FASTNESS_MAGIC_FIRE				"~C4火法~C0：%d"
#define MSG_FASTNESS_PHYSICS				"~C4物理~C0：%d"
#define MSG_FASTNESS_VIRUS					"~C4中毒~C0：%d"
#define MSG_FASTNESS_CHAOS					"~C4混乱~C0：%d"
#define MSG_FASTNESS_STONE					"~C4石化~C0：%d"
#define MSG_FASTNESS_SLEEP					"~C4昏睡~C0：%d"
#define MSG_FASTNESS_WEEK					"~C4衰老~C0：%d"



#define MSG_BAOBAO_DETAIL_INST				"#Y%s#N#E等级：%d#E生命：%d/%d#E魔法：%d/%d#E攻击：%d#E速度：%d#E转生次数：%d#E成长：%.3f#E"

#define MSG_SKILL_DETAIL_INST				"#Y%s#N#E%s#E"


#define MSG_FIGHT_SKILL_DEFULT1			"~O8右键设定默认技能,Alt+1使用~O0"
#define MSG_FIGHT_SKILL_DEFULT2			"~O8右键设定默认技能,Alt+2使用~O0"

#define MSG_FIGHT_NEED_MP				"所需MP:%d"
#define MSG_FIGHT_NOW_MP				"~C4当前MP:%d~C0"										

#define MSG_FIGHT_COMMAND_PLAYER		"~O1主角选择对象~O0"
#define MSG_FIGHT_COMMAND_BAOBAO		"~O3宠物选择对象~O0"

#define MSG_FIGHT_COMMAND_NONE			"~C1  请下达命令~C0"
#define MSG_FIGHT_COMMAND_ATTACK		"使用~C5物理~C0攻击"

#define MSG_FIGHT_COMMAND_MAGIC_SEL		"请选择~C1技能~C0..."
#define MSG_FIGHT_COMMAND_MAGIC			"使用~C5%s~C0"

#define MSG_FIGHT_COMMAND_ITEM_SEL		"请选择~C1物品~C0..."
#define MSG_FIGHT_COMMAND_ITEM			"使用~C5物品~C0"

#define MSG_FIGHT_COMMAND_PROTECT		"使用~C5保护~C0命令"

#define MSG_FIGHT_COMMAND_RECOVER		"使用~C5防御~C0命令"

#define MSG_FIGHT_COMMAND_CHANGE_SEL	"请选择~C1宠物~C0..."
#define MSG_FIGHT_COMMAND_CHANGE		"使用~C5更换宠物~C0"

#define MSG_FIGHT_COMMAND_RUN			"使用~C5逃跑~C0命令"
#define MSG_FIGHT_COMMAND_AUTO_HP		"使用~C5自动补~C1血~C0"
#define MSG_FIGHT_COMMAND_AUTO_MP		"使用~C5自动补~C2法~C0"
#define MSG_FIGHT_COMMAND_AUTO_ATTACK	"使用~C5自动~C0攻击"


#define MSG_FIGHT_TARGET				"对象~C5%s~C0"
#define MSG_FIGHT_LEFT_TARGET_NONE		"~C1  请选择对象~C0"
#define MSG_FIGHT_RIGHT_TARGET_NONE		"~C1  请选择对象~C0"



#define MSG_FIGHT_FIRST_INST			"第一回合战斗,延迟~C4%d~C0秒,左键点击敌人,直接下达主人(宠物)物理攻击命令,右键切换主人或宠物的选择对象"
#define MSG_FIGHT_SPECTATOR				"~C4目前正在观战~C0"
#define MSG_FIGHT_SPECTATOR_COMMAND		"点击这里退出观战"


#define MSG_FIGHT_MAGIC_ATTACK			"~C4%s~C0使用技能~C5%s~C0攻击!!!"
#define MSG_FIGHT_ITEM_USE				"~C4%s~C0使用物品攻击!!!"



#define MSG_FIGHT_ACTION0				"~C4%s~C0对~C1%s~C0使用物理攻击"
#define MSG_FIGHT_ACTION1				"~C4%s~C0对~C1%s~C0使用物品"
#define MSG_FIGHT_ACTION2				"~C4%s~C0对自己使用物品"
#define MSG_FIGHT_ACTION3				"~C4%s~C0准备逃跑!!!"
#define MSG_FIGHT_ACTION4				"~C4%s~C0对~C1%s~C0使用技能攻击"


#define MSG_AUTO_TALK_0					"#54我是女人耶,你还打我,我跟你拼了#91"
#define MSG_AUTO_TALK_1					"很痛吧,嘿嘿嘿#18#18"
#define MSG_AUTO_TALK_2					"怕吧#83知道怎么下逃跑命令吗#18"
#define MSG_AUTO_TALK_3					"对手的失败就是我最大的快乐#28"
#define MSG_AUTO_TALK_4					"希望大家支持神界的研发团队#92，让我们做出更好的游戏来为大家服务#31"
#define MSG_AUTO_TALK_5					"很痛耶,你别那么狠心打我啊#29"
#define MSG_AUTO_TALK_6					"#99对面那个叫做#Y%s#N的,你的攻击太差了#80"
#define MSG_AUTO_TALK_7					"#50#Y%s#N自言自语的说：我实在是太强了#17"
#define MSG_AUTO_TALK_BOSS				"兄弟们!!#4上!!#78,嘿嘿#28"
#define MSG_AUTO_TALK_BOSS_FOLLOW		"杀!!!#31"



#define MSG_FIGHT_TALK_0				"快帮我补血!"
#define MSG_FIGHT_TALK_1				"帮我加法!"
#define MSG_FIGHT_TALK_2				"踢醒我"
#define MSG_FIGHT_TALK_3				"救一下我宠物"
#define MSG_FIGHT_TALK_4				"来不及了!"



// -------- emote 部分 ----------------

#define TOTAL_EMOTE					   200 

#define MSG_EMOTE_0		"0","文明人",\
							"$1从皮包里翻出一副金丝边小眼镜，戴上说：哎呀呀～～身为一个受过高等教育的斯文人，我都有点不好意思了～～～",\
							"大家发现$1不知道从那里借来一副金丝边眼镜，他戴了上说：你们好粗鲁哦，学学我嘛，我好斯文的～～～",\
							"$1戴上金丝边小眼镜对$2小声小气的说：先生，这样恐怕不好吧？再怎么说我也是个斯文人啊#17"

#define MSG_EMOTE_1		"1","顶峰",\
							"年纪轻轻就达到了人生的顶峰的$1失去了对世界的新鲜感，觉得再活下去也没什么追求和意义了！",\
							"$1哭着对大家说:没想到我年纪轻轻就达到了事业的顶峰，除了结束自己的生命之外我别无选择！",\
							"没想到我年纪轻轻就达到了人生和事业的顶峰！下一步，除了结束自己的生命之外我又能如何？$1拍着$2的肩膀说：兄弟，保重了！我先走一步。"

#define MSG_EMOTE_2		"2","头皮屑",\
							"正在赶路的$1走路时潇洒的甩动乌黑的秀发！可是掉落的头屑好多好多～～ ",\
							"$1走路时潇洒的甩动自己的秀发！可是掉落的头屑好多好多，头屑飞舞在大家面前～～",\
							"正在大步流星赶路的$2冷不丁听见$1对他喊：你走路时潇洒的甩动乌黑的秀发！可是掉落的头屑好多好多哦～～都飘到我身上了！好恶心哦～"

#define MSG_EMOTE_3		"3","逞能",\
							"$1一边动手脱下自己的铠甲一边大喊：谁说我是靠铠甲的防御？！以我强壮健美的身躯，用的着吗？",\
							"大家还以为$1要耍流氓，他边脱衣服边吼：告诉你们！就算我脱了铠甲你们一样打不过我的！",\
							"$1边瞪视着$2边缓缓的脱下自己的铠甲叫嚷道：信不信？我脱了铠甲和你裸打一样是我赢！这就是实力！"

#define MSG_EMOTE_4		"4","傻瓜",\
							"$1心里想:卧似梅闻花，卧似深井冰，卧似打春绿，卧似牢木竹。",\
							"卧似梅闻花，卧似深井冰，卧似打春绿，卧似牢木竹～～～大家发现$1打扮的和书生一样摇着纸扇吟着首烂诗出场了。",\
							"卧似梅闻花，卧似深井冰，卧似打春绿，卧似牢木竹。小姐你觉得何如？～$2听了$1为他吟的诗，不由的感到一股恶寒。"

#define MSG_EMOTE_5		"5","饶舌",\
							"量窗量床又量墙，跳上床量窗，靠住墙量床，墙比张床长，床又比窗长～～$1的舌头像风扇一样转动着喷。",\
							"$1舌头打了十八个卷对大家喷：量窗量床又量墙，跳上床量窗，靠住墙量床，墙比张床长，床又比窗长。你们谁的口才能比我好？",\
							"$1看着$2笨嘴笨舌的样子，买弄的对$2喷：#25量窗量床又量墙，跳上床量窗，靠住墙量床，墙比张床长，床又比窗长～～"

#define MSG_EMOTE_6		"6","童年",\
							"$1低头幽幽的想：#40很怀念那段日子，有个人与我静静地走在家乡的小路。",\
							"大家也许不知道，我$1小时候那可是又漂亮又干净！走在路上大家都夸我：好孩子，这么小年纪就出来放猪！",\
							"$2与$1静静的走在家乡的小路上，乡亲们见了都夸$2：嘿，又漂亮又干净！也夸$1：这么小年纪就出来放猪！"

#define MSG_EMOTE_7		"7","不组",\
							"$1看别人有邀请他的意思，故意摆出了一副不屑的嘴脸。样子好虚伪好虚伪～～",\
							"先回答我的问题！$1问：如果说上帝是万能的，那他能创造出自己也举不动的石头吗？答对了才和你们组！",\
							"像狮芬克司一样卧在地上的$1问$2：#28如果说上帝是万能的，那他能创造出自己也举不动的石头吗？。答不对我死也不和你组！"

#define MSG_EMOTE_8		"8","厕所",\
							"$1上完厕所后左右张望，发现确实没人，终于露出了会心的微笑：哇！今天没人看见！不用洗手了！。",\
							"我知道你们讲卫生～～每次上完厕所都要洗手，真的，我丝毫不怀疑，你们都是爱干净的好孩子！～～～$1的话酸的大家牙都掉完了。",\
							"每次$2上完厕所都要洗手。突然一次$2没洗，$1问：今天怎么没洗手？$2答：这次我带纸了！"

#define MSG_EMOTE_9		"9","奶牛",\
							"在顺利通过量身高，称体重，测智商，这些严格的测试之后，$1终于获得了发往光明牛奶场的资格！大家鼓掌！",\
							"$1对大家喊：兄弟们啊快过来！我有急事要找你们：因为要给你们量身高，称体重，测智商，然后发往光明牛奶场。",\
							"$1为$2做了量身高～称体重～测智商～的例行测试后，在$2身上盖了个大红印章（同意发往光明牛奶场）！。"

#define MSG_EMOTE_10	"10","性善",\
							"啊！！$1不小心踩死了一只蚂蚁！大家发现他原地盘腿坐下，开始念经诵佛，超渡蚂蚁的亡魂～～～～～～",\
							"$1腼腆的对大家喊：本人生性善良，平时就连踩死一只蚂蚁也会念经诵佛，超渡亡魂，希望性善者和爱护小动物者与我联系。",\
							"粗心的$1走路的时候一不小心踩扁了$2，他在悲痛之余只好开始念经诵佛，超渡$2的亡魂～～～。"

#define MSG_EMOTE_11	"11","大奖",\
							"一个带着马刀、鸟枪、土炮的蒙面男人像老鼠一样窜来窜去，不停的叫着：我是$1～～我是$1～～～谁敢惹我？～～",\
							"传说中的$1带着一票兄弟在晚上十点整，拿着马刀、鸟枪、土炮到中国人民银行蒙面领取大奖了～～～～～",\
							"$1戴着头巾拿着板刀对$2叫嚷：我中了大奖拉！兄弟你今天晚上十点整，带着马刀、鸟枪、土炮和我到中国人民银行蒙面领取大奖！跟我混不会错！"

#define MSG_EMOTE_12	"12","熊猫",\
							"$1天生一副娃娃脸蛋好玩相，熊猫身材憨态相，招风耳朵好福相，步履摇摆滑稽相，无数的MM都为$1着迷啊！",\
							"大家发现$1居然变身成了一只好肥好肥的熊猫，他会用举字牌子的方式与大家交流。大家感到阵阵的寒意～～",\
							"$1捏着$2的小脸喊：呦？娃娃脸蛋好玩相，熊猫身材憨态相！好可爱的小家伙！你是谁家的孩子这样可爱？"

#define MSG_EMOTE_13	"13","四话",\
							"睁眼说瞎话，闭眼说梦话，逢人说假话，满口是胡话！在获得四话杰出贡献奖之后，$1站在领奖台上忍不住哭了起来。",\
							"$1抱着奖杯，热泪盈眶的对大家说：此时此刻～～我最想对我妈妈说的话是：～～～～妈妈～～我爱你～～～～",\
							"睁眼说瞎话，闭眼说梦话，逢人说假话，满口是胡话！$2在获得四话杰出贡献奖的奖杯后，发誓要在$1的教导下继续学习和进步！ "

#define MSG_EMOTE_14	"14","丑",\
							"#40我长的这样有创意，活着倒也是一种勇气！这至少证明了我是一个有勇气和创意的人！$1终于在痛苦之余找到了自己活下去的理由。",\
							"$1对着人群大喊：#44我长的很有创意，活着是一种勇气，丑不是我的本意，只是上帝发了脾气。我要好好活下去，衬托世界的美丽！！",\
							"$1对着$2喊：你长的很有创意，活着是一种勇气，丑不是你的本意，只是上帝发了脾气。你要好好活下去，衬托世界的美丽！！ "

#define MSG_EMOTE_15	"15","喜欢",\
							"忧郁的$1曾经喜欢过翁美玲，去世了。喜欢过陈百强，病故了。喜欢过张国荣，自杀了。$1再也不敢喜欢其他人了～～～～",\
							"大家听到$1在小声抽噎：#40我喜欢翁美玲，去世了。喜欢陈百强，病故了。我喜欢张国荣，自杀了。我很害怕，因为～～～～也喜欢你们大家！。",\
							"$1大声对$2嚷嚷：#25我喜欢翁美玲，去世了。喜欢陈百强，病故了。我喜欢张国荣，自杀了。我很害怕，因为我也喜欢你～～～～"

#define MSG_EMOTE_16	"16","太阳",\
							"纯情小男生$1看见太阳从远方升起，立刻做出一副多愁善感的模样，居然忍不住感动得哭了出来。",\
							"大家看到多愁善感的纯情小男生$1一个人面对升起的太阳居然感动的哭了起来，不禁背后窜出阵阵凉气～～～",\
							"多愁善感的纯情小男生$1一个人面对升起的太阳居然感动的哭了起来，他对着目瞪口呆的$2叫：你这麻木的人！你不懂得爱！你看太阳～～多美～～～"

#define MSG_EMOTE_17	"17","疯子",\
							"$1手持一把菜刀，用刀背疯狂的拍自己的大腿。",\
							"#40大家都恐惧的原地站着狂流汗，看着$1手持一把菜刀向大家狂奔过来。",\
							"看见有人手持一把菜刀向自己狂奔过来，吓的$2直打哆嗦！等奔近了发现来人是$1，他把菜刀递给$2说：好了，轮你追我了～～说完拔腿就跑。"

#define MSG_EMOTE_18	"18","征婚",\
							"#28征婚拉！本人$1，家贫人丑，一米四九，小学文化，农村户口，没啥长处，扫地拿手。",\
							"$1扯着嗓子冲大家吼：#29征婚拉！本人$1，家贫人丑，一米四九，小学文化，农村户口，没啥长处，扫地拿手。",\
							"$1扯着嗓子对着$2的耳朵大吼：本人$1，家贫人丑，一米四九，小学文化，农村户口，没啥长处，扫地拿手。你嫁我好吗？"

#define MSG_EMOTE_19	"19","偷想",\
							"痴呆一般$1的自言自语：为什么？为什么？为什么我总是偷偷的想你，～～～～还欠我2000块。",\
							"深受人民热爱的$1对着无数的崇拜者说：你们在偷偷想我吗？真的想我就告诉我啊，不会不让你们想我的，大家讲道理嘛，我也想你们啊。 ",\
							"$1深情的对$2说：#40你在偷偷想我吗？如果你真的想我就告诉我啊，我不会不让你想我的。大家讲道理嘛～～～～"

#define MSG_EMOTE_20	"20","绿帽子",\
							"不幸的发现自己被扣了绿帽子的$1终于爆发了！他发出了愤怒的嚎叫：#18只要日子过的去，那怕头上有点绿！我要当忍者神龟！",\
							"$1一副欠打的样子，眯着小眼睛对大家说：上联:只要日子过的去，下联:那怕头上有点绿，横批:忍者神龟。",\
							"悲壮的$1说:#25只要日子过的去！哀伤的$2接道:#25那怕头上有点绿！然后他们合声说：横批！忍者神龟！！"

#define MSG_EMOTE_21	"21","为我死",\
							"#28毕竟曾经也有个女人说愿为我死！她说：$1！你要再缠着我我就去死。",\
							"$1得意的说：#28实话告诉你们，曾经也有个女人说愿为我死！她说：你要再缠着我我就去死！，怎么样？羡慕吗？",\
							"$2使劲的推开凑过来的$1叫道：你要再缠着我我就去死。$1哭丧着脸叫：不！亲爱的！我不能让你为我去死！"

#define MSG_EMOTE_22	"22","送礼",\
							"嘿嘿怪笑的$1打算给大家送一份最特别的礼物，粪量最足，还能大吃一斤。",\
							"$1把一个大铁盒子扔在桌上，对大家说：送大家一份有屎以来，粪量最重的礼物，大家一定会大吃一斤，还要多饱含，如觉粪量不够，还请自便！ ",\
							"$1把一个大铁盒子扔在桌上，对$2说：#25生日快乐！我给你准备了一份有屎以来，粪量最重的礼物，你一定会大吃一斤，还要多饱含，如觉粪量不够，还请自便！"

#define MSG_EMOTE_23	"23","喝酒",\
							"醉成一摊烂泥的$1倒在地上唱：男人喝吧喝吧喝吧不是罪，再好的人也有权利去喝醉。就算喝醉也是一种美！",\
							"$1躺在路上，对路上的行人狂喷酒气：男人喝吧喝吧喝吧不是罪！",\
							"#28男人喝吧喝吧喝吧不是罪～～男人喝吧喝吧喝吧不是罪～男人喝吧喝吧喝吧不是罪～$1一看$2不打算喝他的酒，就爬在$2耳朵前没完没了不停的唱～～"

#define MSG_EMOTE_24	"24","失恋",\
							"悲伤的$1就势躺倒在地上，不断的打滚～～～打滚～～～滚的尘土飞扬。",\
							"我就是心理承受能力非常弱的$1！我告诉你们，不要惹我！你们就不怕我跳楼吗？！我刚刚失恋耶！",\
							"$1圆睁着眼睛对$2吼到：亲爱的，不要离开我！告诉你，体重不是压力，金钱不是能力。我保证我会成为国王的啊～～再给我二十年～"

#define MSG_EMOTE_25	"25","爱你",\
							"彪悍粗壮的$1喘着粗气跑到墙角，还红着脖子扯自己的衣角～～～～居然做出不好意思的样子～～～～",\
							"$1嬉皮笑脸的说：我爱你，可我不敢说，我怕说了我就去死，我不怕死，我怕我死了以后没有人像我这么爱你。所以！我不能说！也不能死！",\
							"$1捧着自己的小脸，嬉皮笑脸的对$2说：我爱你，可我不敢说～～～我好好腼腆的～～～"

#define MSG_EMOTE_26	"26","差身材",\
							"摸摸自己的肚子$1觉得好伤心，自从发福了之后他站着已经看不到自己的脚了～～～",\
							"$1哭丧着脸苦巴巴的说：#40为什么我这样聪明的大脑却配着个大肥肥的身材！",\
							"为什么$2胖是丰满，瘦是苗条，高是修长，矮是秀气。$1胖就是肥猪，瘦是排骨，高是竹竿，矮是冬瓜！我做错了什么？！"

#define MSG_EMOTE_27	"27","休息",\
							"翘着二郎腿的$1坐在沙发上，抽抽烟，喝喝酒，无比的惬意，根本不管同伴的死活。 ",\
							"$1翘着二郎腿坐在沙发上，嘴里叼着根烟，含糊的说：#49我先吸会烟，你们自己先玩会吧～～我享受会。",\
							"懒惰的$1不顾$2在一个人奋勇杀敌，自己跑到阴凉处歇息去了。"

#define MSG_EMOTE_28	"28","地痞",\
							"$1用一把板刀拍着自己的肚皮大叫：我左青龙，右白虎，老牛在腰间～～～～看起来无比的彪悍。",\
							"穿着大背心的$1蹲在街口，看大家在观察他，就刻意露出身上的纹身叫嚷到：#29你们看！看什么看！有什么好看的！没见过黑社会啊？",\
							"穿着大背心的$1蹲在街口，看$2在看他，就刻意露出身上的纹身叫嚷到：你看！看什么看！有什么好看的！没见过黑社会啊？砍你哦！"

#define MSG_EMOTE_29	"29","人工呼吸",\
							"受到轻微攻击的$1迅速的躺倒了，痛苦的呻吟着:#40我要人工呼吸，快，MM，我不行了，人工呼吸啊！",\
							"$1无比英勇的拨开人群，朝众人喷着口水大喊：#96是那个MM要挂了需要做的人工呼吸？！我来了！她在那？～～",\
							"$1无比英勇的拨开人群，朝$2狂喷口水：是这个MM要挂了需要做的人工呼吸吗？！我来了！～～"

#define MSG_EMOTE_30	"30","忙碌",\
							"$1专注的泡着MM谁也不理了。",\
							"$1回头对大家说：#28等会，我正在泡MM呢，等我忙完了再说别的！",\
							"$1回头对$2说：等会，我正在泡MM呢，等我忙完了再说别的！"

#define MSG_EMOTE_31	"31","抱孩子",\
							"听见孩子哭了～～$1起身去抱孩子～～不再理会大家的死活～～",\
							"$1不好意思的说：大家请等我一会，俺的孩子哭了～～～我去抱抱他。",\
							"快要被怪物吃掉的$1大叫：救命啊！～～$2慢悠悠的答：等一下哈，俺的孩子哭了～～我去抱抱他就会来和你继续杀怪。"

#define MSG_EMOTE_32	"32","吵嚷",\
							"无数只苍蝇钻进$1的耳朵，嗡嗡嗡嗡～～～～～～～～的没完。",\
							"$1一脸不耐烦的对吵嚷的大家说：#29什么和什么啊？别叫了！我只觉得有无数只苍蝇钻进耳朵，嗡嗡嗡嗡～～～～～的没完",\
							"烦人的$1化身成一只讨厌的苍蝇钻进$2的耳朵，嗡嗡嗡嗡～～～～～嗡嗡嗡嗡～～～～的叫个没完。"

#define MSG_EMOTE_33	"33","念经",\
							"#28啊嘛呢嘛呢哄～～啊嘛呢嘛呢哄～～啊嘛呢嘛呢哄～～～～～$1头上开始冒烟！看起来已经快成仙了！",\
							"$1盘腿坐在地上，不再和大家说话，开始默念：啊嘛呢嘛呢哄～～啊嘛呢嘛呢哄～～啊嘛呢嘛呢哄～～～～～",\
							"仿佛成了世外高人的$1盘腿坐在地上，不再和$2说话，开始默念：啊嘛呢嘛呢哄～～啊嘛呢嘛呢哄～～啊嘛呢嘛呢哄～～"

#define MSG_EMOTE_34	"34","回复",\
							"这里是$1的自动应答功能，如果是MM请再发一次，我就与你联系！",\
							"$1呆头呆脑的用机器的声音说：#29主人不在，这里是自动应答功能，请听到嘀～的一声后说出你的留言谢谢！嘀～～～",\
							"$1呆头呆脑的用机器的声音对$2说：#25这里是自动应答，MM请再发一次，GG、DD就不要再发了，因为发了也不和你联系！"

#define MSG_EMOTE_35	"35","煮宠物",\
							"红着眼睛盯着自己的宠物看了老半天的$1口水流了一键盘：看起来好好吃～～ ",\
							"贪吃的$1口水流了一键盘，红着眼睛说：喂，你们的宠物看起来好好吃啊～～",\
							"$1口水流了一键盘，红着眼睛对$2说：喂，你的宠物看起来好好吃啊～～"

#define MSG_EMOTE_36	"36","孤独",\
							"谁说单身不好，爱情诚可贵，自由价更高，若为单身故，两者皆可抛。这就是我$1的人生哲学。",\
							"$1看着别人成双成对，含着眼泪说：#52谁说单身不好？我是为了自由才单身的！说完哭了起来。",\
							"$1看着别人成双成对，哭着对$2说：我好嫉妒他们！，不如我们也～～～～。"

#define MSG_EMOTE_37	"37","傲然",\
							"$1拔刀，怒向苍天傲然站立！风呼呼的吹着，哇！他居然能保持发型不乱！",\
							"站在屋顶，头顶锅盖的$1努力的做大侠状叫：拔刀冲天笑，怒目向娥娇。别人星捧月，我独傲云霄。",\
							"$1拔刀冲天笑，怒目向娥娇。别人星捧$2，我独傲云霄！"

#define MSG_EMOTE_38	"38","别学我",\
							"听说秃头的人是聪明绝顶，$1就豪不犹豫的把头发剃光了。",\
							"$1一副鄙夷的样子说：不要学我！你们知道吗？自然秃头的人是聪明绝顶。闻讯后把才把头剃光的人是自作聪明！",\
							"$1一副鄙夷的样子对$2说：#16这你就不懂了吧！自然秃头的人是聪明绝顶。闻讯后把才把头剃光的人是自作聪明！"

#define MSG_EMOTE_39	"39","境界",\
							"贫穷的$1努力的掏着口袋，口袋里居然什么都没有～～～也算是穷出境界了～～～",\
							"贫穷的$1努力的掏着口袋，结果只掏出几个硬币，只好红着脸说：穷，这也是种境界！你们懂吗？",\
							"$1努力的掏着口袋，结果只掏出几个硬币，只好红着脸对$2说：别看我穷！这是我刻意追求的人生境界！你懂吗？"

#define MSG_EMOTE_40	"40","我愿意",\
							"#40嫁鸡随鸡，嫁狗随狗，嫁到猴子通山跑！我$1这辈子只好就这样下去了～～5555555～～",\
							"$1双手叉腰生气的大吼：#52我嫁鸡随鸡，嫁狗随狗，嫁到猴子通山跑！我愿意～～～你们管得着吗？",\
							"一把鼻涕一把泪的$1呜咽着说：#25我嫁鸡随鸡，嫁狗随狗，嫁到猴子通山跑！事已至此，我也没办法了～～这辈子只好跟了$2了～555555"

#define MSG_EMOTE_41	"41","奋斗",\
							"前途是光明地～～～道路是曲折地～～～～不要灰心～～～～$1要排除万难继续奋斗～～～～！！！ ",\
							"$1跑到最前排，做出一副无敌正义的英雄架势叫道：#37前途多么的光明啊～～～道路多么的曲折啊～～～",\
							"$2还在犹豫的时候，$1大叫着：前途是光明地～～～不要灰心～～～～跟我继续奋斗～～～～冲啊！冲上去了。 "

#define MSG_EMOTE_42	"42","坏孩子",\
							"穿着大背心和拖鞋的$1，傻傻的坐在路口发呆！",\
							"$1穿着大背心和拖鞋，跳出来叫：老子天不怕，地不怕，就怕老师来我家。坐俺的墩儿，喝俺的酒，老师一走妈就打。",\
							"$1穿着大背心和拖鞋，跳出来对$2叫：天不怕，地不怕，就怕老师来我家。坐俺的墩儿，喝俺的茶，老师一走妈就打俺#40。"

#define MSG_EMOTE_43	"43","土气",\
							"原来我$1这样呆呆的人还是有人会喜欢的啊！嘿嘿～～～嘿嘿～～～～嘿嘿嘿～～",\
							"嬉皮笑脸的$1对大家喊：#29你们别看我傻～～～呵呵～～嘿嘿～～～嘻嘻～～～其实我很懂事的～～～～",\
							"$1嬉皮笑脸的对$2喊：你有点灵气，我有点傻气，如果你生气，我不会发脾气。"

#define MSG_EMOTE_44	"44","爱钱",\
							"$1辛苦的回忆着：我记得是谁还欠我两毛三分钱来着？我怎么突然记不起来了？",\
							"摆出一副老江湖的嘴脸的$1，阴沉的说：人生本无缘，相见就更难，说句心里话，谁不爱钱啊？",\
							"$1摆出一副老江湖的嘴脸，深沉的对$2说：#28人生本无缘，相见易更难，说句心里话，老子最爱钱。"

#define MSG_EMOTE_45	"45","求人",\
							"在走头无路的情况下$1提出的请求还是被拒绝了，于是忍不住哭起了起来：～～～呜～～妈妈～～有人欺负我～～",\
							"$1看见大家有求于他，得意的开始念叨：#28大海呀！它全是水。地狱呀！它全是鬼。骏马呀！它四条腿。只会求我的你们呀！咧着嘴～～",\
							"看见$2有求于他，$1开始念叨：大海呀！它全是水。地狱呀！它全是鬼。骏马呀！它四条腿。只会求我的$2呀！咧着嘴。"

#define MSG_EMOTE_46	"46","宽容",\
							"大肚能容天下难容之事，慈颜常笑笑世上可笑之人。$1努力的鼓起肚子，装的像个大人物似的笑道：哈哈哈哈～～～～",\
							"$1咧着嘴看着正在争执的大家笑道：你们怎么不学学我啊？大肚能容容天下难容之事，慈颜常笑笑世上可笑之人。",\
							"$1咧着嘴看着正在争执的$2笑道：$2怎么不学学我啊？大肚能容容天下难容之事，慈颜常笑笑世上可笑之人。"

#define MSG_EMOTE_47	"47","利用",\
							"黑着脸的$1下定决心：朋友就是用来利用的，兄弟就是用来出卖的！我要出卖兄弟！～～～～",\
							"你们要多跟我学学，朋友就是用来利用的，兄弟就是用来卖的，$1我能有今天就是这样混出来的！",\
							"$1一脸沧桑的对$2说：#28朋友就是用来利用的，兄弟就是用来出卖的，老大我就是这样混出来的！"

#define MSG_EMOTE_48	"48","被打",\
							"被怪物打的灰头土脸的$1趴在地上叫：人可倒，势不可倒！长城不倒，我亦不倒！",\
							"$1被众人打得趴在地上爬不起来，他在地上努力的边整理整理发型边叫：人可倒，势不可倒！长城不倒，我亦不倒！",\
							"$1被$2打得趴在地上爬不起来，他在地上努力的边整理整理发型边叫：人可倒，势不可倒！长城不倒，我亦不倒！"

#define MSG_EMOTE_49	"49","麻烦",\
							"人活着还要吃饭，睡觉，上厕所实在是太麻烦了！$1觉得自己活的好辛苦。",\
							"$1一副壮志未筹的模样说：#40我想当皇帝，怕罗嗦！想当大官，怕事多！想吃饭，怕刷锅！真想揍你们一顿，又怕打不过！",\
							"#40想当官，怕事多！想吃饭，怕刷锅！真想揍$2一顿，又怕不是$2的对手！"

#define MSG_EMOTE_50	"50","禽兽",\
							"谁刚才说$1是禽兽？我刚听见拉！谁说我坏话？有种给我站出来！～～",\
							"$1转身对大家露出了甜美的笑容说：谁说我是禽兽？禽兽尚有半点怜悯之心，我一点都没有，所以我不是禽兽！",\
							"$1转身对$2露出了甜美的笑容，他说：你说我是禽兽？禽兽尚有半点怜悯之心，我一点都没有！所以我不是禽兽！"

#define MSG_EMOTE_51	"51","博爱",\
							"富有爱心的$1用慈爱的眼光观察着这个世界，当他看到：小鸟在歌唱，小树发芽了，小草变绿了，心中好高兴～好高兴～～",\
							"$1激动的对大家说：我对你们之爱，比司马光还光！对你们之情，比诸葛亮还亮！对你们之心，比关云长还长！",\
							"看着$2肥肥的小脸。$1禁不住表白：我对你之爱，比司马光还光！对你之情，比诸葛亮还亮！对你之心，比关云长还长！对你之意，又何需多讲！"

#define MSG_EMOTE_52	"52","绝望",\
							"$1无语了！头上流出一颗超级大汗珠。",\
							"大家发现在发抖的$1头上流出一颗超级大汗珠。",\
							"$1脸上流出一大颗汗珠对$2说：后面看你是期望，侧面看你是失望，正面看你是绝望。"

#define MSG_EMOTE_53	"53","兄弟情",\
							"#28什么事情能比的过我们兄弟之情更重要？绝对没有！我$1行走江湖这么多年，这点小道理还是懂的！",\
							"威严的$1教导自己的小弟：#28女人的事再大也是小事，弟兄的事再小也是大事！是在一个地方吃一辈子饭，还是一辈子到哪儿都有饭吃？懂吗？？",\
							"大大咧咧的$1对$2说：女人的事再大也是小事，你的事再小也是大事！放心，我罩着你！"

#define MSG_EMOTE_54	"54","手足",\
							"心中一片悲壮，$1抱着往日和他一起奋战的兄弟们哭了起来。",\
							"$1大大咧咧的对兄弟们说：#28朋友如手足，女人如衣服，手足不可断，衣服天天换！",\
							"$1大大咧咧的对$2说：朋友如手足，女人如衣服，手足不可断，衣服天天换，你觉得如何？"

#define MSG_EMOTE_55	"55","美在",\
							"少女之心，美在无瑕，赤子之心，美在无邪～～～～而像我$1这样善良完美正直的人美在那里呢？简直是全都美～～",\
							"$1一脸酸酸的表情说：#96少女之心，美在无瑕，赤子之心，美在无邪，壮士之心，美在无畏，志士之心，美在无私～～～～",\
							"一脸酸酸的$1对$2说：#16壮士之心，美在无畏，志士之心，美在无私～～～～姑娘我觉得你～～～～全都美～～"

#define MSG_EMOTE_56	"56","圣旨",\
							"鼻涕眼泪哭了一脸的$1干嚎道：#40臣，接旨谢恩～～～",\
							"$1扯着嗓子喊：宣圣旨，奉天承运，皇帝召曰：三年不准拉屎，拉屎不准用纸，用纸不过三尺，直到憋死为止，钦此！",\
							"大内总管$1扯着嗓子对$2喊：宣圣旨，奉天承运，皇帝召曰：$2三年内不准拉屎，拉屎不准用纸，用纸不过三尺，直到憋死为止，钦此！"

#define MSG_EMOTE_57	"57","蚊子",\
							"$1烦躁的说：蚊子好多！怎么睡觉啊！",\
							"$1无奈的说：春眠不觉晓，处处蚊子咬。夜来巴掌声，蚊子死不了。",\
							"一脸痴呆的$1对$2说：春眠不觉晓，处处蚊子咬。夜来巴掌声，蚊子死光光。"

#define MSG_EMOTE_58	"58","太帅",\
							"心灰意冷的$1决定去整容，要整的难看一点，因为如今美女爱丑男，男生还是丑点好。",\
							"$1一脸沮丧的对大家说：#40被爱在最后，被甩走前头，若问为什么，因为我太帅，如今美女爱丑男，男生还是丑点好。",\
							"帅气的$1一脸沮丧的对$2说：#52为什么！为什么！为什么要怪我？我长的帅～～～这并不是我的错啊！！！"

#define MSG_EMOTE_59	"59","上帝",\
							"好不容易爬上山峰的$1对着天空喊：我并不帅！！！！天上传来阵阵的雷声，一个苍远的声音说：你～～～撒谎～～～～！",\
							"面对群情激动的MM们$1哭着喊：你们都去看别人吧～～我并不帅！！！！MM们愤怒了！她们异口同声的叫：你～～～撒谎～～～～！",\
							"面对神情激动的$2，$1哭着喊：请你去看别人吧～～我并不帅～～～～$2被激怒了！他愤怒的喊：你～～～撒谎～～～～！"

#define MSG_EMOTE_60	"60","芳草",\
							"在经历了第99次失恋之后终于得出了结论：天涯何处无芳草，为何要在本处找！",\
							"$1一脸不高兴的对大家说：天涯何处无芳草，为何要在本处找，本来数量就不多，况且质量也不好！",\
							"$1一脸不高兴的对$2说：天涯何处无芳草，为何要在本处找，本来数量就不多，况且质量也不好！"

#define MSG_EMOTE_61    "61","败逃",\
							"一看打不过对方，$1立马施展起凌波微步逃窜，回头对着强大的敌人叫：别看我今天心太软，你就任逍遥！～～我会报仇的～～",\
							"被打的门牙乱掉的$1施展起凌波微步逃窜，他回头对强大的敌人叫：#7别看我今天心太软，你们就任逍遥！555555555",\
							"$1一看强敌在前，顾不得可怜的$2自己逃走了，$1远远的喊：$2！不用担心，我上峨眉山顶苦练神功！5年以后一定为你报仇！放心吧～～"

#define MSG_EMOTE_62    "62","寻找",\
							"$1一个人哭嚎道：#40你是黑暗中的灯泡，饥饿中的面包，冬天里的棉袄，夏天里的雪糕。你在哪啊？ ",\
							"激动的$1跑过来一把搂住大家，哭嚎道：#52你们是黑暗中的灯泡，饥饿中的面包，冬天里的棉袄，夏天里的雪糕。终于找到你们了！",\
							"$1跑过来一把搂住$2，哭嚎道：#52$2就是黑暗中的灯泡，$2就是饥饿中的面包，$2就是冬天里的棉袄，$2就是夏天里的雪糕。终于找到你了！$2！！"

#define MSG_EMOTE_63    "63","跳楼",\
							"神情呆滞的$1爬上了二层楼凉台，威胁大家说他准备要跳楼了！",\
							"$1对着来看热闹的人群喊：#31跳楼须知，挣扎请到五楼，残废请到四楼，住院请到三楼，吓人请到二楼，看热闹请到一楼。",\
							"$1对着来看热闹的$2喊：来看热闹的吧？后边排队去！"

#define MSG_EMOTE_64    "64","文化人",\
							"轻轻的$1走了，正如$1轻轻的来了。$1撞一撞大楼，不留下一片瓦块～～ ",\
							"不知道那里捡了一副金丝边眼睛的$1酸酸的说：#13轻轻的我走了，正如我轻轻的来了。我掉进粪坑，不留下一丝痕迹～～",\
							"$1努力作出文化人的样子对$2说：轻轻的你走了，正如你轻轻的来了。你撞一撞大楼，不留下一片瓦块～～"

#define MSG_EMOTE_65    "65","有罪",\
							"#18如果帅是一种罪，那么$1已罪犯滔天。如果酷是一种错，那么$1已一错再错。做人真惨啊！",\
							"$1对着众人忏悔：#52如果帅是一种罪，那么我已罪犯滔天。如果酷是一种错，那么我已一错再错。",\
							"号啕大哭的$1对$2说：#52如果帅是一种罪，那么我已罪犯滔天。如果酷是一种错，那么我已一错再错。做人真惨啊！"

#define MSG_EMOTE_66    "66","变态",\
							"寂寞啊寂寞，如果$1不在寂寞中恋爱，$1就会在寂寞中变态！ ",\
							"$1背过身去怪笑着对大家念叨：不在寂寞中恋爱，就在寂寞中变态！",\
							"$1不再看$2，背过身去怪笑着念叨：寂寞啊孤独，不在孤独中恋爱，就在寂寞中变态！"

#define MSG_EMOTE_67    "67","过来人",\
							"酒是穿肠的毒药！色是刮骨的钢刀！气是下山的猛虎！钱是惹祸的根苗！555555～～～～$1哭了起来～～",\
							"一副过来人样子的$1对大家说：#28酒可是穿肠的毒药，色是刮骨的钢刀。气是下山的猛虎，钱是惹祸的根苗啊～～～千万别学我～～",\
							"$1作出一副过来人的表情对$2说：你要小心，酒是穿肠的毒药，色是刮骨的钢刀。气是下山的猛虎，钱是惹祸的根苗～～可千万不要学我啊～～"

#define MSG_EMOTE_68    "68","警报",\
							"在看完提示之后，$1立即起立，一阵狂奔，跑到安全的地方去了。 ",\
							"#84警告！地球上的电脑因超负荷使用，内部发生裂变，即将爆炸，请看完本提示后立即起立奔至安全处～～并稍后在$1处购买安全防辐射头套～",\
							"$1对$2喊：你的电脑因超负荷使用，内部发生裂变，即将爆炸，请看完本提示后立即起立奔至安全处～～～～"

#define MSG_EMOTE_69    "69","爱大米",\
							"$1边跳边傻叫：爱你，爱你，我爱你，就像老鼠爱大米。我不打你，也不骂你，我就是要烦死你！",\
							"$1边跳边对大家喊：#30爱你，爱你，我爱你，就像老鼠爱大米。我不打你，也不骂你，我就是要烦死你！怕了吧！",\
							"$1边跳边对$2喊：爱你，爱你，我爱你，就像老鼠爱大米！"

#define MSG_EMOTE_70    "70","狗叫",\
							"趴在地上的$1叫：万万望望、望旺万旺、万腕忘忘、万旺万旺～～～～万旺万旺～～～～",\
							"$1勇敢的冲大家喊：你们的中文标准吗？请跟我一起念：万万望望、望旺万旺、万腕忘忘、万旺万旺～～～～",\
							"$2你想学发音吗？请跟我一起念：万万望望、望旺万旺、万腕忘忘、万旺万旺～～～"

#define MSG_EMOTE_71    "71","正确",\
							"我这个人能成功多是因为我比较有原则～～，第一：我永远是对的，第二：如果我错了，请参阅第一条！",\
							"专横的$1回头对疑惑的大家说：你们给我记住了！第一：我永远是对的，第二：如果我错了，请参阅第一条！",\
							"专横的$1回头对疑惑的$2说：记住了！第一：我永远是对的，第二：如果我错了，请参阅第一条！"

#define MSG_EMOTE_72    "72","使坏",\
							"#40$1终于气得嘤嘤的哭了起来～～～～～引来好多人围观～～～～",\
							"看到大家倒了霉，$1没忍住还是笑了出来～～～～看到大家怒目相视，又硬生生把笑收了回去，尴尬啊～～～",\
							"$1幸灾乐祸的对$2说：#16你生气了吧？生气的话就哭～～出～～来～～吧～～～嘻嘻嘻嘻！"

#define MSG_EMOTE_73    "73","斗鸡眼",\
							"谁说我$1是斗鸡眼？！我只是把视线集中在一点以改变我已往对事物的看法！",\
							"面对大家的嘲笑$1一甩衣袖肃然说：#43你们说我斗鸡眼？我只是把视线集中在一点以改变我已往对事物的看法！",\
							"$1一甩衣袖肃然对$2道：我只是把视线集中在一点以改变我已往对事物的看法！"

#define MSG_EMOTE_74    "74","拜晚年",\
							"$1双眼上翻，哆嗦着自顾自的说：各位观众，中秋节刚过，我给拜个晚年～～～～～～",\
							"$1双眼上翻，哆嗦着对大家说：#33各位观众，中秋节刚过，我给大家拜个晚年～～～～～～",\
							"$1双眼上翻，哆嗦着说：各位观众，中秋节刚过，我给$2拜个晚年～～～～～～"

#define MSG_EMOTE_75    "75","高手",\
							"杀怪物已经杀红眼的$1想：#18我还年轻～～～要抓紧锻炼身体～～～～这样PK时才会像不倒翁一样～～～～～",\
							"PK高手$1对大家说：#7你们还年轻～～～要抓紧锻炼身体～～～～否则PK时会很菜～～～～～",\
							"PK高手$1对徒弟$2教导道：你还年轻～～～要抓紧锻炼身体～～～～这样PK时才会像不倒翁一样～～～～～"

#define MSG_EMOTE_76    "76","美男",\
							"#28帅哥我今年十八九，至今还没找女朋友，人家上街是手牵手，我是左手牵右手！",\
							"$1环视四周后，终于的开口道:#29要不要我临场发挥一下？",\
							"愤怒的$1盯着$2的眉毛说:#24你吓唬我？要不要试试？我和别人比帅从来就没怕过！"

#define MSG_EMOTE_77    "77","关心",\
							"天气凉了，注意加衣服，不要感冒！",\
							"$1用关切的目光扫射周围:#46大家最近怎么样？听说在流行非典～～～要小心那～～～～～",\
							"$1悄悄的对$2说：别来可无恙？寄语白云间，祝你永平安。"

#define MSG_EMOTE_78    "78","幽思",\
							"忧郁的$1望着一轮弯月心中很不平静:#40山川河流可以使人与人互相阻隔，却无法将心与心阻隔，无论你走到天涯海角。我的心永远陪伴着你。",\
							"$1清了清喉咙，对着大家吟道:#40思念中我一千次一万次地问鸿雁问明月问春风，愿明月将我的问候带给你，愿春风将我的关切送给你！",\
							"传说中的泡妞王子$1对着$2不停的放电:#40时间冲不淡真情的酒，距离拉不开思念的手。想$2，直到地老天荒，直到永久。"

#define MSG_EMOTE_79    "79","辣妹",\
							"$1低头想:#9知道吗，其实第一次和你牵手，我就决定今生一定做你的新娘、永远的爱人。",\
							"$1对着人群喊:#98你在偷偷想我吗？你真的是在偷偷想我吗，如果你真的想我就告诉我啊，我不会不让你想我的，大家讲道理嘛。我也想你啊。",\
							"传说中的泡妞王子$1向$2放电:#93我不是最美的花朵，但我要为你盛开欢乐～～我要怒放～～怒放～～怒放～～"

#define MSG_EMOTE_80    "80","嘲讽",\
							"$1正所谓～～只要日子过的去～～～～那怕头上有点绿～～～～～横批:忍者神龟。",\
							"$1跳到桌子上对着人群叫道:#6送你们一份有屎以来，粪量最重的礼物，你们一定会大吃一斤，还要多饱含，如觉粪量不够，还请自便！",\
							"$1看着$2大笑:你长的很有创意，你活着是一种勇气;丑不是你的本意，只是上帝发了脾气。你要好好活下去，只有你能衬托世界的美丽！"

#define MSG_EMOTE_81    "81","非你不娶",\
							"深沉而成熟的男人$1低吟道:#42爱你一万年，是我的追求，恋你一千年，是我的渴望；而吻你一次，则是我一生中最快乐的时光；答应我，嫁给我吧！",\
							"$1对着山下的人群喊道:#84我用手记忆了你的样子，用耳记忆了你的声音，用唇记忆了你的味道，用心记忆了你的一切，我爱你！",\
							"含情脉脉的$1看着$2说出了压在心里几年的话:#38左手刻着我，右手写着你，当我们掌心相对，心心相印时，所有的人都会看到：我爱你$2！"

#define MSG_EMOTE_82    "82","赞美",\
							"#42你是那样地美，美得象一首抒情诗。留给我印象最深的是你那长长的、一闪一闪的睫毛。像是探询，像是关切，像是问候。",\
							"走来走去走来走去的$1终于鼓起勇气不知道对谁大喊:#42只有莲花才能比得上你的圣洁，只有月亮才能比得上你的冰清。",\
							"深情的$1看着$2说:#42在风吹干$2的散发时，在淡淡入鬓的额眉间，在碧水漓漓的眼睛里，你竟是如此美丽可人！"

#define MSG_EMOTE_83    "83","臭美",\
							"#28我偷听到你对上帝祈祷：你非我不嫁，所以我不想你背叛上帝！",\
							"$1得意洋洋的说:#28你知道的嘛～～像你这么丑的一定嫁不出去～～怎么办？只好我牺牲了。",\
							"$1抽了口烟，然后慢悠悠的对$2说:喝吧喝吧喝吧不是罪，再好的人也有权利去喝醉。就算喝醉也是一种美，做人何必装的那么虚伪！！！！！！！！"

#define MSG_EMOTE_84    "84","简洁的爱",\
							"#42轻轻地，不惊你梦；只愿你，梦中有$1。安好～～～～～",\
							"$1对着人群喊:#84不需言语，让我用行动告诉你，什麽叫爱～～",\
							"$1的眼睛闪着五彩的泪花，泪花中映着$2可爱的脸庞:#40以为没有你～～～～终于知道我不行～～"

#define MSG_EMOTE_85    "85","誓言",\
							"因为苦涩，才去品尝，因为感动，才去深爱～～～～",\
							"站在高山上的$1大喊:我爱你！无论你爱不爱我！你都是我的最爱！一生一世！",\
							"$1盯着$2的小眼睛深情的说:#98你的眉目之间，锁着我的爱怜，你的唇齿之间，留着我的誓言。"

#define MSG_EMOTE_86    "86","感动",\
							"用力咬破了自己的指头后，$1用指头写下誓言:如果有一天你老了，老的连牙齿也没了，我仍然会吻你没有牙的牙床。",\
							"终于得逞的$1哭诉道:#40我们就像两滴泪水，终于流成了一行。",\
							"$1对着$2深情的说:#40第一次哭是因为你不在，#50第一次笑是因为遇到你，第一次笑着流泪是因为拥有你！"

#define MSG_EMOTE_87    "87","诗意",\
							"#40满天星云下，感到无边的落寞。也许流星能体会。我期待，飘飘雪花的日子，你的心带来了一屡芬芳。",\
							"走在大街上的$1不小心撞到了墙上，还在胡言乱语的说:#45透过开满鲜花的月亮，依稀想到你的模样。那层冰冷冰冷的屏幕，充满温柔充满幻想。",\
							"$1含情脉脉的看着$2说:#38红色的花白色的纱娇羞的面颊，浅浅笑里说出一句愿意的回答，挽你的手在我臂弯，走进一个温暖地方名字叫做家。"

#define MSG_EMOTE_88    "88","风沙",\
							"倒霉的$1揉了揉眼睛:#81哦，又进沙子了。",\
							"抽筋的$1在人群中边跳边唱道:你是风儿我是沙，你是皮鞋我是刷，你是面我是开水，泡你到永远。",\
							"$1开心的对着$2唱道:#81$2是风儿$1是沙，$2是皮鞋$1是刷，$2是面$1是开水，我要泡你到永远。"

#define MSG_EMOTE_89    "89","诗人",\
							"在枫叶飘舞的季节，$1吟道:既已相遇，何忍分离，愿年年岁岁永相依；柔情似水，佳期如梦，愿朝朝暮暮永相携。",\
							"欠打的$1对着一群和尚说:醉过方知酒浓，爱过方知情重。(被众人痛扁)",\
							"$1眉头一皱，严肃的对$2说:#81爱的雪花，染白了头发；情的四季，揉皱了面颊。与你一起互依互靠，为彼此的一切操心操劳。"

#define MSG_EMOTE_90    "90","灵魂",\
							"被打晕的$1挣开模糊的双眼，居然看到自己的灵魂到处飘动～～～～～～",\
							"大明星$1对着舞台下抑扬顿挫的说:我要用灵魂感觉你的春夏秋冬，用生命感觉你的东南西北，用舌尖感觉你的酸甜苦辣，用一生感觉你的是非对错。",\
							"$1深情的看着$2吟道:#40我要用灵魂感觉你的春夏秋冬，用生命感觉你的东南西北，用舌尖感觉你的酸甜苦辣，用一生感觉你的是非对错。"

#define MSG_EMOTE_91    "91","有你",\
							"$1哭着说:我还记得我最困难时的那位永远支持我的人！我是不会忘记他的！",\
							"天空平原上空响起$1的喊声:#23有你，我不再孤单，当我落泪，有你帮我拭去，当我寒冷，你拥我入怀，我不再孤单！亲爱的，我～爱你！！",\
							"$1对$2说出了价值千金的四个字:有你就好！"

#define MSG_EMOTE_92    "92","雨季",\
							"落寞的$1看着镜子哭:#40谁来告诉我！我的花季哪里去了？我的雨季哪里去了？",\
							"$1听说魔域城里似乎能找回失去的时光，所以来到魔域城门前大叫:还我雨季，还有花季，还有我甜甜的青春～～～",\
							"终于见到了久别的$2，$1哭了起来:#98如果还是雨季，我还愿与你同行！我愿买下所有的玫瑰和巧克力。将我的心和这一切奉献给你。"

#define MSG_EMOTE_93    "93","相遇",\
							"$1叹道:我何时才能见到心爱的人啊，啊啊啊，啊，啊，啊。",\
							"看看白云看看小草又看看大草，$1傻傻的说:#23与你相遇在夏日黄昏的午后，想你在秋季漫漫的风霜里，只想轻轻的问你---让我爱你一生，好吗？",\
							"$1看了$2一眼，然后又～～终于说出:#23与你相遇在夏日黄昏的午后，想你在秋季漫漫的风霜里，只想轻轻的问你---让我爱你一生，好吗？"

#define MSG_EMOTE_94	"94","情人节",\
							"正所谓：有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。",\
							"$1向众人宣布:也许我把爱情定义错了。但无论怎样，在2月14日前！我一定会找到媳妇的！",\
							"可怜巴巴的$1看着$2:#98也许我们把爱情定义错了。但无论怎样，我就想亲口对你讲那三个字！给我个机会，在2月14日。好吗？"

#define MSG_EMOTE_95    "95","怀念",\
							"$1望着明月叹道:但愿人长久，天涯若比邻。",\
							"$1望着明月对众人大发感叹，叹的大家吐了一地！",\
							"终于见到了久违的$2，$1激动的说:事到如今我依然爱你。我一直在等你把所有的风景都看透之后，回来陪我看细水长流。"

#define MSG_EMOTE_96    "96","青蛙王子",\
							"青蛙青蛙满天飞～～～～～你为谁飞舞～～～～",\
							"爱情天皇$1对着大家语重心长的说:#23如果青蛙没有变成王子，如果公主没有醒来，如果小人鱼没有化作泡沫，你还会相信爱情吗？",\
							"$1对着$2说:#98如果青蛙没有变成王子，如果公主没有醒来，如果小人鱼没有化作泡沫，我还会相信爱情吗？相信！因为还有你在我的身边。"

#define MSG_EMOTE_97    "97","青山",\
							"漫步在精灵城郊外，$1不禁诗性大发，胡乱吟道:山外青山楼外楼，你不爱我我发愁。世上美女到处有，就是没有你温柔！",\
							"厚颜无耻的$1对无知的小朋友们说:青山绿水真真好，漂亮女子人人爱。为了祖国下一代，必须赶快谈恋爱。",\
							"$1似乎很认真的看着$2:青山绿水真真好，漂亮女子人人爱。为了祖国下一代，必须和你谈恋爱。"

#define MSG_EMOTE_98    "98","结巴的爱",\
							"像发了羊颠疯一样的$1抽搐着说：#96我～～我～～爱～～爱～～爱～～你～～",\
							"$1看到在场的人很多，一时有点紧张:#96亲爱的老婆老老婆老婆婆你在想我吗？你老公老老公老公公可想你了！",\
							"$1看到了心爱的$2，一时有点紧张:#96亲爱的老婆老老婆老婆婆你在想我吗？你老公老老公老公公可想你了！"

#define MSG_EMOTE_99    "99","飘雪",\
							"一片雪花飞进$1的怀里。飞进了$1的脖领、飞进了$1的～～哇！！怎么没拉拉链！？",\
							"$1开心的帮大家数着天上飘落的雪花:#36一，一，二，三，啊嚏！二，三，四～～ ",\
							"$1看着$2很认真的说:哦！下雪了！我真想变成一片雪花飞进你的怀里。我飞进了你的脖领、飞进了你的～～你怎么没拉拉链！"

#define MSG_EMOTE_100   "100","怪异的爱",\
							"神情痛苦的$1摇头晃脑的号叫:你是疯啊，我是傻，缠缠绵绵到没牙！",\
							"$1向众人宣布:#23你可以和别人约会，只要不让我发现。我偶尔也会出轨，但保证心在你这边。",\
							"$1郑重的向$2解释:#28接吻时双方在唾液中交换了9毫升的水份、1克的蛋白质、2克的有机物、3毫克油脂和4毫克盐。"

#define MSG_EMOTE_101   "101","郁闷的爱",\
							"几夜未眠的$1很痛苦的说:#8关关雎鸠，在河之洲。窈窕淑女，君子好逑。求之不得，寤寐思服。悠哉悠哉，辗转反侧。",\
							"$1无奈的向众人宣布:#81我这几天吃三口饭就饱，睡15分钟觉就够，腮帮子都陷下去了，都是爱情惹的祸！",\
							"$1两眼发黑，脸色苍白，仍旧微笑着对$2说:#81我这几天吃三口饭就饱，睡15分钟觉就够，腮帮子陷下去，都是爱情惹的祸！"

#define MSG_EMOTE_102   "102","天荒",\
							"夜深人静$1无法入睡，眼前浮现出一幕幕老婆秀丽的身影。",\
							"$1咬咬牙干了一瓶二锅头，对众人说:时间冲不淡真情的酒，距离拉不开思念的手。直到地老天荒，直到永久。",\
							"$1与$2共拥着暖人的烛光叹道:#23时间冲不淡真情的酒，距离拉不开思念的手。想你，直到地老天荒，直到永久。"

#define MSG_EMOTE_103   "103","数字爱情",\
							"痴情的$1练习和情人告白:众人皆醒我独醉，心有灵犀最珍贵。邂逅真情爱不悔，今生只为你相随。(每一句的第五个字)",\
							"开心的$1向众人宣布:10％执着+10％想念+10％吃醋+10％疑心+10％甜蜜+10％心疼+10％幸福+10％嫉妒+10％脸红+10％撒娇=100％爱情。",\
							"$1开心的和$2玩猜谜:#45天鹅湖边鸟飞绝，良无一点双人行。双木非林心相连，您若无心先自飞。谜底：我很想你$2。"

#define MSG_EMOTE_104   "104","泪雨",\
							"一边睡一边打胡噜的$1开始说梦话：～～娟～娟～别离开俺～俺会好好对你！",\
							"$1悲鸣:#52重翻你往昔的情书！竟把它们烧成了纸灰，和泪吞下。倘若有一朝纸灰能复燃，请它把我那深藏着爱情之火的热心肠也燃烧成灰吧！",\
							"$1正在看书，突然从树上流下潺潺小溪把书打湿，抬头望去原来是$2躲在树上痛哭流涕。"

#define MSG_EMOTE_105   "105","红杏",\
							"$1饿了好久，#23一把红杏很快吃完了。",\
							"无奈的$1很无奈的说:跟你说过多少次了，晚上要当心，不要出门，你就是不听，这不，昨天晚上又跑到我的梦里来了，害得我不愿醒来！",\
							"$1嘴一撅对$2喝道:#23你再不对我好一点，再惹我生气，小心我爬墙喔～～就是红杏出墙啦！"

#define MSG_EMOTE_106   "106","伤心",\
							"眼神暗淡下来的$1蒙上了一层灰色，忧郁的转过身走了。",\
							"$1的眼神暗淡下来～～～蒙上了一层灰色，流着泪说道：啥也别说了！伤自尊了#40",\
							"$1的眼神暗淡下来～～～蒙上了一层灰色，流着泪对$2说：啥也别说了！伤自尊了#40"

#define MSG_EMOTE_107   "107","结巴",\
							"$1郁闷的想：大～～～大～～～大～～～家家～～～大家会不会瞧不起我呢？#83",\
							"非常开心的$1的向大家说道：大～～～大～～～大～～～家～～～家好～～～大家好#83",\
							"紧张的$1对$2说：你～～～你～～～你好！请问，火～～～火火～～～火车站，怎～～～怎么走#83"

#define MSG_EMOTE_108   "108","减肥",\
							"沮丧的$1说：#83看到你们我才知道什么是肥婆，所以我不打算减肥了#86",\
							"信心十足的$1向大家宣布：#30我正在布置着详细的减肥计划，很快你们就可以看到我轻盈的身姿了。",\
							"$1对$2说：#83请你不要在减肥了，你的马已经减轻40斤了，可你还是那个样子。"

#define MSG_EMOTE_109   "109","长相",\
							"$1看着镜子里的自己不禁感叹道：哇！我的相貌实在是天下无敌啊#30",\
							"疯狂的$1站在山上大喊：哇！我才发现！我的相貌实在是天下无敌啊#30",\
							"$1对$2说：你的样子实在是太像残暴者了$2悄悄的对$1说：请勿泄露国家机密#54"

#define MSG_EMOTE_110   "110","祈祷",\
							"$1默默的祈祷着：愿我的主宰保佑我的子民#20",\
							"喜欢祈祷的$1大声的说：愿主宰保佑神的子民#20",\
							"$1抚摩着$2的头说：我的孩子，我会保佑你的，你就安心的去吧#49"

#define MSG_EMOTE_111   "111","茫然",\
							"茫然的看着自己的脚印，不知道自己现在想些什么#32",\
							"表情呆滞的$1茫然间消失在人群中#32",\
							"$1看了看$2无奈中只有茫然的离去#32"

#define MSG_EMOTE_112   "112","紧张",\
							"清楚的听见自己的心跳。",\
							"紧张的$1望着大家说：为什么被选中的总是我#83",\
							"$1 紧张的望着$2说：为什么被选中的总是我#83"

#define MSG_EMOTE_113   "113","冲动",\
							"$1失去了往日的理智，以致用头用力的撞击一块豆腐#75",\
							"热血拥上心头的$1似乎已经失去了往日的理智#37",\
							"$1发疯般的拉住$2的手说：为什么？为什么？为什么#40"

#define MSG_EMOTE_114   "114","幸灾乐祸",\
							"$1悄悄的钻进水泥管里偷着笑#25",\
							"像老鼠一样叽叽叽笑着的$1悄悄的躲在角落#25",\
							"$1看着$2开心的唱到：为什么？受伤的总是你#25"

#define MSG_EMOTE_115   "115","开心",\
							"刚拣到1块钱的$1脸庞滑落了一行开心的泪水#40",\
							"$1开心的泪水滑落脸庞#40",\
							"$1紧紧的抱住$2开心的样子仿佛回到了童年#98"

#define MSG_EMOTE_116   "116","悲伤",\
							"伤感的$1看着远方，仿佛进入了无限的遐想#95",\
							"$1看上去似乎都要哭了#81",\
							"$1安慰$2说：悲伤是你的动力，成功是我的喜悦#28"

#define MSG_EMOTE_117   "117","失落",\
							"$1现在的心情犹如刚学会飞翔的小鸟成为猎人的目标～～～#40",\
							"委屈的$1看着大家，终于忍不住：哇啊啊啊～～～啊啊啊～～～的哭了。#40",\
							"$1看着$2，心底的酸楚不由的涌了出来#40"

#define MSG_EMOTE_118   "118","傻子",\
							"前天被天上掉的鱼砸到的$1四下张望着，渴望有人能用热呼呼的肉包子砸他#46",\
							"$1睁大眼睛傻傻的看着远方#24",\
							"$1傻傻的看着$2心想：这家伙大大的耳朵能不能搞来做下酒菜啊#16"

#define MSG_EMOTE_119   "119","无辜",\
							"无奈的$1看着天空，渴望看到理解的天使#10",\
							"满脸委屈的$1心想；这次我真的完了，跳进大海我也洗不清了#81",\
							"$1对着$2说：你就交代了吧，我们是会原谅你的#18"

#define MSG_EMOTE_120   "120","鼓励",\
							"$1坚决的给了大家一个肯定的眼神#4",\
							"斗志昂扬的$1大声的喊道：兄弟们为了理想冲啊#90",\
							"$1深情的望着$2说：曙光已在你眼前，困难将离你远去，再加把油就能看到胜利了#43"

#define MSG_EMOTE_121   "121","惊讶",\
							"$1仔细擦了擦眼睛，还是不能相信发生的事实#24",\
							"惊讶的$1张大了嘴许久都没有合上#24",\
							"$1望着$2惊叫道：天下怎么会有的绝色美人，真是难得一见啊#97"

#define MSG_EMOTE_122   "122","叹息",\
							"$1感叹道：天下间竟然就没有一个能与我抗衡的对手吗#28",\
							"自问天下无敌的$1感叹道：天下间竟然就没有一个能与我抗衡的对手吗#28",\
							"$1对$2叹道：想我纵横江湖数载，看到像你这样有资质的年轻人实在是少之又少啊#28"

#define MSG_EMOTE_123   "123","吹牛",\
							"一本正经的$1说：看我名贯天下武功盖世，是何等的风光！我又向谁说过呢#28",\
							"$1用力的向一头牛吹啊吹的#95",\
							"$1高兴的对$2说：难怪最近牛的数量急剧减少，原来都是被你吹死了啊#24"

#define MSG_EMOTE_124   "124","假正经",\
							"$1拿起一本中国古书大声念道：知之为知之，不知为不知，若要人不知，别来做教师#99",\
							"贼眉鼠眼的$1左看右看，四下无人，趁机拿了药店一贴痔疮膏。",\
							"行走江湖数载的$1教导$2 说：像我们练武的人要眼观六路耳听八方！方可行走天下。哎呀！是谁在用砖头丢我#54"

#define MSG_EMOTE_125   "125","装睡",\
							"似睡半醒的$1还不时半睁着眼睛偷看一眼#83",\
							"$1似睡半醒还不时半睁着眼睛偷看一眼#83",\
							"$1朦胧的双眼还不时睁开来偷看一下对面的$2似乎有一丝丝诡异#83"

#define MSG_EMOTE_126   "126","思念",\
							"流着泪花的$1看了看大家，感慨的说道：兄弟们，我想死你们了，哈哈#51",\
							"$1回头望着大家，思念涌上心头，不禁流下泪水#81",\
							"$1 看着 $2深情的说：送君千里终须一别，回去吧#40"

#define MSG_EMOTE_127   "127","攻击",\
							"$1大喊道：大家一起冲上去啊#31",\
							"最胆小的$1 大喊道：大家一起冲上去啊#31",\
							"$1对$2说：不要畏惧，勇敢的向前冲吧，胜利是属于你的#31"

#define MSG_EMOTE_128   "128","爱情",\
							"$1看到了久别的情人，激动的热泪涌出了美丽的双眸#97",\
							"光棍$1对大家说：爱一个人是不求回报的#96",\
							"$1深情的看着$2说：世间本无沙漠，我每想你一次，上帝就落下一粒沙，从此便有了撒哈拉#96"

#define MSG_EMOTE_129   "129","浪漫",\
							"神经质的$1一边把自己手中的花一瓣一瓣撕开，一边念叨：他爱我～～他不爱我～～他爱我～～他不爱我～～#78",\
							"$1感叹道：为什么总是没人爱呢#78",\
							"$1对$2说：今天你吃的饱吗？睡的好吗？深夜会冷吗？"

#define MSG_EMOTE_130   "130","疲倦",\
							"被众人扁的大叫的$1喊道：各位英雄你们就饶了我吧#40",\
							"虚弱如蚂蚁的$1的手在颤抖，眼前的一切都变模糊了#75",\
							"$1握着$2的手，慢慢的没有了意识～～～～～～#91"

#define MSG_EMOTE_131   "131","担心",\
							"$1不安的说不出话来#32",\
							"无法抑制自己情绪的$1，即使在大家面前，还是忍不住不停的用手抠自己的裤边。#32",\
							"$1颤抖的抓着$2的手一时不知道说什么好了#32"

#define MSG_EMOTE_132   "132","力量",\
							"$1摆了摆几个不错的造型，展示下自己健美的身材#44",\
							"苦练肌肉3天的$1用力的敲了敲胸脯，显示下肌肉#29",\
							"$1看着$2健美的身躯无疑是对自己多年来的减肥计划一个沉重的打击，真是欲哭无泪啊#99"

#define MSG_EMOTE_133   "133","犹豫",\
							"$1一时间不知道该怎么办了#85",\
							"$1的灵魂徘徊在天堂与的狱之间#42",\
							"无奈的$1看着$2的灵魂说：哎！可怜的孩子就这样去了#40"

#define MSG_EMOTE_134   "134","满意",\
							"$1对自己完美的发型还是还是挺满意的。",\
							"一向爱小便宜的$1开心的说：主宰很满意，结果还不错#93",\
							"$1对$2说：主宰很满意，结果还不错#93"

#define MSG_EMOTE_135   "135","痛苦",\
							"$1感叹道：牙疼不是病，可疼起来真的好要命#40",\
							"坚强的$1咬紧牙关，没有发出痛苦的呻吟，但是却～却～尿湿了裤子#40",\
							"$1用力的捏了下$2的鼻子，$2痛苦的流下了两行鼻涕大叫：大侠饶命#40"

#define MSG_EMOTE_136   "136","勤奋",\
							"经过多年的磨练$1终于练就了一身天下无敌的本领#28",\
							"$1感叹道：山中方一日，世上已千年，弟兄们练级好快啊！#39",\
							"$1兴奋的对$2说：你就是国家的栋梁，未来的希望，世间的英雄，我们的楷模，继续加油啊#30"

#define MSG_EMOTE_137   "137","着急",\
							"向来慢性子的$1缓缓的说：干着急是没用的，要像我一样沉着冷静#95",\
							"$1眼睁睁的看着，自己被一点点的宰割，哎，好痛苦#85",\
							"$1看着$2着急的喊道：你该换好点的机器了#54"

#define MSG_EMOTE_138   "138","流泪",\
							"$1的眼泪如排山倒海，似万马奔腾般涌了出来#40",\
							"痛哭流涕的$1对大家说：男儿有泪不轻弹，只因未到伤心处#40",\
							"$1望着$2不停的眨眼，终挤出了两滴泪水#40"

#define MSG_EMOTE_139   "139","唱歌",\
							"$1深情的望着你，一曲《爱人》能否打动你的心#42",\
							"擅长制造噪音的$1高唱道：拉拉啊，拉，拉拉#42",\
							"愤怒的$1对着$2说：你不要再唱歌了，这样的噪音我实在受不了啦#54"

#define MSG_EMOTE_140   "140","美女",\
							"$1四下环视，怎么就找不到一个美女呢#46",\
							"一向自信的$1感叹自己的容貌简直就是倾城倾国，举世无双，闭月羞花，沉鱼落雁啊#17",\
							"$1感叹$2的容貌简直就是倾城倾国，举世无双，闭月羞花，沉鱼落雁啊#17"

#define MSG_EMOTE_141   "141","直觉",\
							"经过苦苦思索的$1，逐渐从冥冥中悟到了第八感#28",\
							"$1大喝一声：有什么了不起的！大不了跟着感觉走#54",\
							"激动的$1对$2说：有什么了不起的！跟着我的感觉走！绝对没问题！"

#define MSG_EMOTE_142   "142","决心",\
							"$1暗下决心，不达目的决不回头#99",\
							"流着泪的$1对着初升的太阳叫道：有志者事竟成！我一定要成功#34",\
							"$1对着$2流着泪叫道：有志者事竟成！一定要成功啊！"

#define MSG_EMOTE_143   "143","防守",\
							"帅气的$1大叫道：看我，如～～～来～～～神～～～掌#84",\
							"脸憋的通红的$1，大叫道：看我，如～～～来～～～神～～～掌#84",\
							"$1对$2大叫道：看我的，如～～～来～～～神～～～掌#84"

#define MSG_EMOTE_144   "144","装酷",\
							"$1拨拨自己的头发，然后一甩，得意的不行#7",\
							"自视潇洒的$1拨拨头发，然后一甩硬是装出一副帅哥模样#7",\
							"$1拨拨头发，然后一甩硬是对$2装出一副帅哥模样#7"

#define MSG_EMOTE_145   "145","怒吼",\
							"愤怒的$1喊道：这是谁家的狗乱跑，为什么总是色咪咪的看着我#54",\
							"$1蹲在茅厕里大喊大叫：是谁把手纸挂在门外的#54",\
							"$1对着$2大叫，把正在嘘嘘的$2吓的尿了一裤子#83"

#define MSG_EMOTE_146   "146","自夸",\
							"心虚$1悄悄的说：其实我就是传说中，风流倜傥，玉树临风，风度翩翩的男人#28",\
							"很心虚的$1漫不经心的说：其实我就是传说中改变社会风气，风靡万千少女，玉树临风，风度翩翩的帅哥了#99",\
							"$1一本正经的把脸凑过去对$2说：#28其实我就是传说中改变社会风气，风靡万千少女，风流倜傥，玉树临风，风度翩翩的美男子了#99"

#define MSG_EMOTE_147   "147","魅力",\
							"得意的$1把自己的头发向上拨了拨，说道：不好意思！我就是传说中那个可以迷死万千少女的少妇杀手了#28",\
							"有着大嘴巴的$1张着大嘴巴想：怎么说我也是传说中的那个可以迷死万千少女的少妇杀手啊，怎么可以对一个老太太动心#83",\
							"$1瞪着$2喊叫：难道你就是那个可以迷死万千少女的少妇杀手吗？我可是你忠实的FANS啊，给我签个名吧#97"

#define MSG_EMOTE_148   "148","拍马屁",\
							"$1 低头郁闷，自己拍自己的马屁啊？真没意境！",\
							"小个子的$1讨好的说：各位好啊，看你们一个个天庭饱满，都是大福之人那！小弟今天开门遇贵人，真是不胜荣幸啊#48",\
							"$1一脸讨好的对$2说：你以为躲起来就找不到你了吗？没有用的！像你这样出色的男人，无论在什么的方，都像黑暗中的萤火虫一样，那样的鲜明#48"

#define MSG_EMOTE_149   "149","狂妄",\
							"傲慢的$1说：凭你们的智慧，很难理解这样深奥的问题#80",\
							"$1一脸鄙夷扫了周围一眼：凭你们的智慧，我不想多做解释#80 ",\
							"$1一脸鄙夷的对$2说：凭你的智慧，怎么能理解这样深奥的东西呢#80"

#define MSG_EMOTE_150   "150","势利",\
							"$1背过身去小声的笑，不过最后还是憋不住大笑了出来～～哦活活活活～～～～#86",\
							"吃的很饱的$1摸着鼓起的大肚子说：各位，现在都流行AA制，我们还是把帐算清楚吧#29",\
							"$1摸着$2的肚子说：谈钱会伤感情嘛！不过我跟你没什么感情可言，还是谈钱直接一点。"

#define MSG_EMOTE_151   "151","看书",\
							"$1认真的看着书却不小心撞到了墙上。",\
							"自信的$1向众人宣布：我最喜欢看书了，看的可多了，可多了，多的不得了，像～～～像～～～反正很多了#83",\
							"近视眼$2看书掉到河里，$1大笑：想不到你比我看书还痴迷啊#28"

#define MSG_EMOTE_152   "152","双截棍",\
							"哼！我有双截棍双截棍！哼哼哈兮！我有双截棍双截棍！哼哼哈兮#47",\
							"很傻的$1抽出两根油条，一边挥舞一边对大家喊：哼！我有双截棍双截棍！哼哼哈兮！我有双截棍双截棍！哼哼哈兮#47",\
							"$1抽出两根油条一边挥舞一边对$2大吼：哼！我有双截棍双截棍！哼哼哈兮！我有双截棍双截棍！哼哼哈兮#47"

#define MSG_EMOTE_153   "153","分离",\
							"$1流着激动的泪水，从颤抖的嘴唇挤出几个字：我去了，我一定好好改造，争取减刑#40",\
							"被众人狂扁后的$1拱起拳头大喝一声：各位英雄！后会有期！然后一溜烟跑了。",\
							"$1紧握着$2的手，两行泪花直流而下，他激动的说：你即将远行 ，再远再难，记住我的思念。好好改造，争取减刑#40"

#define MSG_EMOTE_154   "154","装备",\
							"$1一把脱下汗衫大喊：超越人类体能！创造微操奇迹！我一定要证明真正的男人是不用依赖装备的#29",\
							"戴着墨镜的$1对着天空说：看这里的环境和大家的造型，就知道你们太没有内涵了#28",\
							"$1拍着$2的肩膀说：年轻人，男人的魅力是要多年沉积出来的，一看你这身装备就知道你还年轻啊#28"

#define MSG_EMOTE_155   "155","妹妹",\
							"$1背过身去小声抽噎：我就知道这个世界上我最孤独，永远都没人爱。说完$1一边哭一边跑走了#40",\
							"蹦蹦跳跳的$1跑过来讨好的说：各位妹妹！我来了！谁欺负你们只管跟我说！！！这片是我罩着的！",\
							"一脸坏笑的$1对$2说：谁欺负你拉？我心灵感应到你有危险，特意跑来保护你！我愿意把我宽阔的肩膀借你依靠，不客气！"

#define MSG_EMOTE_156   "156","思念",\
							"$1自己心中一酸，不由老泪纵横，吟道：明知相思无用处#40无奈难解相思苦 ，问君可知此时情 只恐梦魂别处住。",\
							"$1面对圆圆的月亮，脸上爬着两行浊泪吟道：明知相思无用处 无奈难解相思苦 ，问君可知此时情 只恐梦魂别处住。",\
							"羞涩的$1对着$2小声吟道：明知相思无用处 无奈难解相思苦 ，问君可知此时情 只恐梦魂别处住。"

#define MSG_EMOTE_157   "157","忍",\
							"$1的肚子因为生气，涨鼓鼓的像个球，他大声对自己说道：我要忍！忍！",\
							"众人的小宇宙不断提升～～～～$1看周围气氛不对赶忙说道：#11喂喂喂！大家不要生气，生气会犯了嗔戒的！",\
							"$1紧张的望着$2说：大哥～～～不要生气嘛～～～开个玩笑而已～～～何必那样紧张呢#17"

#define MSG_EMOTE_158   "158","吐",\
							"$1哭丧着脸说：呜呜呜呜，没关系你们吐啊吐啊就习惯了，我可以等。",\
							"吃坏肚子的$1的胸脯剧烈的起伏，抽搐着说：大家给我点时间～～～我吐啊吐啊的就习惯了#74",\
							"$1对着$2一脸无所谓的说 ：没关系，我吐啊吐啊就习惯了#74"

#define MSG_EMOTE_159   "159","杀死",\
							"$1倒在地上无力的呻吟：谁敢杀我？我会十级诅咒的你不知道吗？天天晚上找你哦。",\
							"惊讶的$1对大家说： 噢，对啦！我差点忘记了，今天是我的斋戒日。",\
							"$1对着$2的尸首说道：对啦！我差点忘记了，今天是我的斋戒日！不好意思啊，我不是故意的，请你原谅#17"

#define MSG_EMOTE_160   "160","祝福",\
							"$1心中一阵悲壮，心中默想：佛祖！上帝！安拉大神！智慧之神！还有力量之神！请你们保佑我吧！",\
							"一脸真诚的$1双手合十说道:千言万语无从说起，世界的美好全送给大家，每天的晨曦为我们祈祷#50",\
							"$1张着水汪汪的大眼睛望着$2的背影说：千言万语无从说起，世界的美好全送给大家，每天的晨曦为我们祈祷，祝你永远快乐#50"

#define MSG_EMOTE_161   "161","组队",\
							"泪汪汪的$1对自己说：人家不就是攻击有点低嘛，从来都没人要组我，也从来都没人会可怜我#48",\
							"一蹦一跳的$1跑过来，讨好的说：各位大哥看你们的造型就是有文化底蕴的团体，可否组上小弟我呢？我唱歌很好听啊#48",\
							"$1紧紧抓住$2的肩膀瞪着牛眼说：真希望能和你合作去做一番大事业，光凭我们的魅力都可以赚不少呢#89"

#define MSG_EMOTE_162   "162","结婚",\
							"开心的$1想：太了好，已后有人为我背药，带我练级，保护我了，还得给我赚钱，养我～～～嘿嘿！嫁个好男人真爽#79",\
							"$1仰空长叹：唉 ，又一个一夜之间由女孩变成女人一个月之后由女人变成女仆的不幸的人#95",\
							"$1望着$2一脸可惜的说：唉 ，又一个一夜之间由女孩变成女人一个月之后由女人变成女仆的不幸的人#95"

#define MSG_EMOTE_163   "163","可爱",\
							"可爱的$1咬着指甲，大眼睛扑扇扑扇做出美少女战士的表情#17",\
							"美丽的$1咬着指甲，大眼睛扑扇扑扇的说：好可爱哦，人家好好稀饭哦#17",\
							"$1咬着指甲，大眼睛扑扇扑扇的对$2说：你好可爱哦，人家好好稀饭哦#17"

#define MSG_EMOTE_164   "164","死亡",\
							"倒在地上的$1看着旋转的天空想：出道前，我就知道出来混，迟早都是要还的，我认了#83",\
							"$1倒在地上，看着旋转的天空想：出来混，迟早是要还的，这我认了#14",\
							"$1看到$2躺在地上仰天大笑道：哈哈哈哈，$2你也有今天啊！难道你不知道出来混，迟早都是要还的吗#28"

#define MSG_EMOTE_165   "165","乞讨",\
							"$1以迅雷不及掩耳盗铃之势捉到一只头发里的虱子，迅速吃了下去，然后感叹道：恩，是时候该去讨点东西了#81",\
							"$1以迅雷不及掩耳盗铃之势趴到地上，对大家哭道：可怜可怜我吧，给点钱花吧#40",\
							"衣衫褴褛的$1一把抱住$2的双腿哭号：哥哥啊你不该抛弃我这可怜的孩子啊，再怎么你也得对我负责啊，就给点吃的吧#40"

#define MSG_EMOTE_166   "166","吝啬",\
							"有钱人$1小心的从口袋里掏出5个金币，对着天空高喊：好！我也买块豆腐改善一下生活。",\
							"$1捂住自己的口袋，苦苦的说：城里的东西好贵啊#83",\
							"委屈的$1一把捂住自己的口袋对着$2说：给我留点吧！这几个月我头一回赚到点钱～～～"

#define MSG_EMOTE_167   "167","人才",\
							"一脸得意的$1对大家说：21世纪什么最贵？那就是像我这样的人才懂吗#28",\
							"得意的$1对大家说：21世纪什么最贵？那就是像我这样的人才懂吗#28",\
							"$1一脸得意的对$2说：21世纪什么最贵？那就是像我这样的人才懂吗#28"

#define MSG_EMOTE_168   "168","遗言",\
							"$1艰难的说：我这个月的党费谁帮我交了吧#17",\
							"快要不行的$1困难的睁开双眼，艰难的说：我这个月的党费谁帮我交了吧#17",\
							"$1困难的睁开双眼，忍受着巨大的痛苦，艰难的对$2说：我这个月的党费你就帮我交了吧#17"

#define MSG_EMOTE_169   "169","让路",\
							"红了眼的$1低着脑袋向前冲去，嘴里狠狠的嚼着几个字：挡我者死#37",\
							"无敌的$1一边跑过一边大叫道：我很急！让开让开，挡我者死#37",\
							"$1边跑边对试图挡住他的$2说：让开让开，挡我者死#37"

#define MSG_EMOTE_170   "170","小偷",\
							"紧张的$1看着大家，手紧紧的捂着口袋，头上直冒汗。",\
							"$1走到大家附近，一会看看这个的腰包，一会盯盯哪个的口袋，一副贼眉鼠眼的样子。",\
							"$1溜达到$2附近，小贼眼紧紧的盯着$2的口袋，不知道脑袋里想什么鬼注意#28"

#define MSG_EMOTE_171   "171","吃",\
							"日照香炉升紫烟，$1来到烤鸭店。口水流下三千尺，一摸口袋没有钱。#49",\
							"$1的左手拿了三个馒头嘴里叼着一个，一边右手往盘子里探，一边瞪着大家说：快来快来，晚了就没有了#49",\
							"$1的左手拿了三个馒头嘴里叼着一个，一边右手往盘子里探，一边瞪着$2说：快来快来，晚了就没有了#49"

#define MSG_EMOTE_172   "172","傻笑",\
							"$1扑通一声倒在地上，抱着肚子一边狂笑一边蹬他的小腿#88",\
							"痴呆的$1望着大家发了呆，突然他扑通一声倒在地上，抱着肚子一边狂笑一边蹬他的小腿#88",\
							"$1看着$2的眼睛，突然扑通一声倒在地上，抱着肚子一边狂笑一边蹬他的小腿#88"

#define MSG_EMOTE_173   "173","无聊",\
							"$1冷冷的说：做什么，我就是不想理你#25",\
							"小心的$1用指头捅一捅这个，捅一捅那个，见大家都不理他，只好低下头保持沉默#90",\
							"无聊的$1用指头捅一捅$2，见$2理都不理他，只好低下头保持沉默#90"

#define MSG_EMOTE_174   "174","美女",\
							"$1双手叉着腰得意的说：真是太遗憾了，这么大的地方怎么就我一个是美女啊#14",\
							"色眯眯的$1瞧瞧这个，瞧瞧哪个，问：今天来的美女不少嘛#97",\
							"$1色眯眯的瞧着$2说：哎呀！！这丫头怎么长的，怎么长这么漂亮啊#97"

#define MSG_EMOTE_175   "175","大款",\
							"沮丧的$1低头看看自己大大的肚皮心里默默的想：难道有钱也是我的错么#24",\
							"无奈的$1低头看看自己大大的肚皮心里默默的想：难道有钱也是我的错么#24",\
							"$1向$2咧嘴一笑，露出满口大金牙：缺钱早说么，钱我有的是#28"

#define MSG_EMOTE_176   "176","价格",\
							"$1双手叉腰一副管家婆架势喊道：有没有搞错，现在进货那么贵，你出的那点钱还不够本呢#54",\
							"双手叉腰气愤的$1喊道：有没有搞错了，这点破东西就要我那多钱#54",\
							"$1对着$2大叫道：你有没有搞错，这点破东西就要我那多钱#54"

#define MSG_EMOTE_177   "177","傲慢",\
							"怪异的$1背过身去，颤抖着发出某种类似妖魔的笑声#25",\
							"无敌的$1一脸冷漠，无视大家的存在，牛气哄哄的走过去了#80",\
							"$1瞟了一眼$2，什么也没说就牛气哄哄的走过去了#80"

#define MSG_EMOTE_178   "178","败",\
							"$1一边擦着眼泪一边说：算你狠，等我回去苦练武功咱们后会有期。",\
							"一边擦着眼泪一边哭的$1哼哼：今天算你们强，咱们后会有期再决胜负#37",\
							"$1一边擦着眼泪一边对$2哭道：今天是你运气好，要不是我状态不佳你早被我干掉了，算了，我闪先～#91"

#define MSG_EMOTE_179   "179","勇敢",\
							"喜欢鬼故事的$1擦了擦脸上的冷汗，扶了扶发抖的腿，然后继续给大家讲鬼故事。",\
							"胆小的$1拿出一根针，扎了一下自己的小指头，再靠前一步，我就血溅五步，怕了吧？#37",\
							"$1手里攥着一个绿毛毛虫得意的对$2说：我已经彻底不怕它了#37"

#define MSG_EMOTE_180   "180","帅",\
							"笑嘻嘻的$1擦了擦脸上的唇印说：我咋这么受欢迎！你们真是太热情了#41",\
							"帅哥$1正在酒店门口签名售照片，GM提醒大家凭小票排队领取。",\
							"$1对$2说：以后谁要是敢在你面前说他最帅，你就把我的照片给他看看。"

#define MSG_EMOTE_181   "181","抢劫",\
							"一脸横肉的$1恶狠狠的说：抢劫！IP，IC，IQ卡，通通告诉我密码#4",\
							"$1抡着块砖头冲进来大喊：抢劫！IP，IC，IQ卡，通通告诉我密码#4",\
							"$1对$2说：我～我～我先劫个色#97"

#define MSG_EMOTE_182   "182","苦笑",\
							"苦闷的$1感叹道：为什么痛苦总是要我一个人来承受#40",\
							"$1的脸上流露出一丝丝苦闷的笑容。",\
							"$1看着$2，似乎都快哭了。"

#define MSG_EMOTE_183   "183","微笑",\
							"$1的脸上露出了难得一见的笑容#86",\
							"天真无邪的$1对着大家微微的笑了#86",\
							"$1对着$2微微的笑了#86"

#define MSG_EMOTE_184   "184","疑惑",\
							"一向开朗的$1的眉头紧紧皱起了起来，仿佛又要被困难征服了#35",\
							"$1一脸疑惑的看着大家却不知道该怎么说。",\
							"$1疑惑的看着$2似乎遇到了前所未有的难题，也许人生最大的考验就在面前了#35"

#define MSG_EMOTE_185   "185","恭喜",\
							"开心的$1说：同喜，同喜#1",\
							"$1对着大家鞠了一圈躬说：恭喜，恭喜#93",\
							"$1对$2说：恭喜，恭喜#93"

#define MSG_EMOTE_186   "186","无知",\
							"无奈的$1摸了摸后脑勺，然后又摸了摸，然后又～～～",\
							"$1说：听说的球是方的哦，真的吗#32",\
							"$1一脸的天真无邪，水汪汪的小眼睛看着$2说：求求你教教我好吗，1加1为什么不等于6？#32"

#define MSG_EMOTE_187   "187","大叫",\
							"愤怒的$1对着高山狂吼：为什么～～～#84",\
							"$1深吸了一口气，怒吼：我～～～饿～～～拉～～～#84",\
							"$1对着$2大叫：啊啊啊啊，哈哈，吓倒了吧#10"

#define MSG_EMOTE_188   "188","迷路",\
							"$1自言自语：这里我怎么感觉这么熟悉，以前似乎来过，不管了，赶路要紧#46",\
							"仔细的看了看地图的$1恍然大悟：我晕，难怪半天没走到，原来走反了#28",\
							"$1一副很认真的样子给$2指路：先左转，再左转，再左转，再左转，就到了#46"

#define MSG_EMOTE_189   "189","大吃",\
							"可怜的$1默默的吞下口水，摸了摸口袋，叹道：已经断粮七天啦#84",\
							"干巴巴的$1似乎几年没吃了，连苹果核都吞了，正在吐：哇哇，啊哇#74",\
							"$1直直的看着$2，好像在看着一只肥羊说：来来，再过来一点，乖哦#89"

#define MSG_EMOTE_190   "190","水",\
							"干渴的$1使劲吞了吞：连口水都没啦。",\
							"$1在沙漠里迷路了几天，最后不断的呻吟着：水～～～水～～～#36",\
							"$1给了$2一杯黑墨水：这是最流行的饮料，喝吧#25"

#define MSG_EMOTE_191   "191","流汗",\
							"无奈的$1擦了擦汗说：是不是到了非洲了，怎么这么热？#83",\
							"手在颤抖的$1的眼前的一切都变模糊了：我真的走不动了#83",\
							"$1使劲踹了$2一脚，喝道：竟敢在我面前装累，看脚，吼吼哈嘿#37"

#define MSG_EMOTE_192   "192","害怕",\
							"勇敢的$1尽管装的冷静泰然，其实已经尿湿了裤子。",\
							"不怕死的$1使劲按住发抖的手，坚决的说：谁害怕谁是小狗#83",\
							"$1紧紧的搂住了$2的大腿：我好怕#40"

#define MSG_EMOTE_193   "193","发抖",\
							"怕鬼的$1拍了拍不争气的手：怎么就这么胆小。",\
							"看见连桌子都抖的快倒了，$1不解的说：地震了吗#87",\
							"疑惑的$1奇怪的看着$2一直颤抖，不安的看了看屋顶：地震了吗，我怎么没感觉那#32"

#define MSG_EMOTE_194   "194","飞碟",\
							"$1不相信自己的眼睛：真的啊，真的是啊！这不是个气球吗#32",\
							"$1指着天空大叫：飞碟来啦，大家快跑啊#51",\
							"喜欢减肥药的$1拍了拍$2的肩膀：你看，你看，飞碟来了（趁机拿了$2的减肥药）#83"

#define MSG_EMOTE_195   "195","跳舞",\
							"$1对自己的身材还是很满意的：我真是天生的舞蹈天才啊，哈哈哈哈#18",\
							"肥肥的$1一边哼着小曲，一边扭动粗大的腰肢：先生，我跳的好不好啊#39",\
							"$1拉着$2跳拉丁舞，$2被踩的大叫：噢噢噢，噢～～～#83"

#define MSG_EMOTE_196   "196","踢人",\
							"超级酷而且帅的专业玩家$1对自己的队伍进行了清理，把没有自己帅的队员都给踢了！",\
							"超级酷而且帅的专业玩家$1对队长叫：喂，队长～请把没有我帅的队员都给踢了！免得大家被菜鸟拖累！",\
							"超级酷而且帅的专业玩家$1看着$2叫：喂，队长～请把这个没有我帅的队员踢了！免得大家被菜鸟拖累！"

#define MSG_EMOTE_197   "197","散步",\
							"勤奋的$1千辛万苦翻山越岭来到火车站，只见门口一个大牌子：今日休息，请明天再来。",\
							"悠闲的$1走在精灵城，突然觉得脚下软软的：是谁家的狗随的大小便啊#54",\
							"$1牵着$2的手坐在美丽精灵城的长椅上聊天，却无意间发现旁边的一块牌子：注意，油漆未干。"

#define MSG_EMOTE_198   "198","为美",\
							"我敢于追求美，有为了美而献身的勇气，试问在现在这个物欲横流的社会中，还有什么人肯为了美而付出一切？？只有大色狼我啊！",\
							"大家要敢于追求美！要有为了美而献身的勇气！试问在现在这个物欲横流的社会中，还有什么人肯为了美而付出一切？？只有我色狼$1啊！",\
							"$2！你别看不起我！至少我有为了美而献身的勇气！试问在这个物欲横流的社会中，还有什么人肯为了美而付出一切？只有我色狼$1啊！"

#define MSG_EMOTE_199   "199","色狼",\
							"我认为我身为一名色狼是很可敬的，因为色狼善于发现美，善于从寻常的琐事中发现MM们优秀的品质！",\
							"色狼$1在教育他的徒弟们：我认为我身为一名色狼是很可敬的，因为色狼善于发现美，善于从寻常的琐事中发现MM们优秀的品质！",\
							"色狼$1正色告诉$2：我认为我身为一名色狼是很可敬的，因为色狼善于发现美，善于从寻常的琐事中发现MM们优秀的品质！是多么的难得啊！"




#endif		// GB Version






#endif	// TEXTMSG_H